{"games":[{"game":{"title":"Axe of the Ancients: Dwarven Fury","url":"https:\/\/distribution.gameflare.com\/embed\/axe-of-the-ancients-dwarven-fury\/","description":"Axe of the Ancients: Dwarven Fury is an epic action hack-and-slash adventure, blending stunning visuals with classic gameplay inspired by Warcraft and Golden Axe.  \r\n\r\nStep into the boots of Thorne, a battle-hardened dwarf who, at 75, thought his warrior days were over—until fate called him back to arms. Corruption has overtaken his homeland, and only his legendary axe can restore balance. His journey begins in the dreaded Dungeon of Skeletons, a cursed crypt where the undead roam restlessly. With every swing, Thorne carves a path through darkness, uncovering secrets of the Ancients and forging his legacy.  \r\n\r\nAre you ready to embrace the fury and reclaim what was lost?","instructions":"Left mouse button - Attack, Right mouse button - Lock on enemy, WASD keys - Move, Spacebar - Jump, SHIFT - Run, E - Strong attack, Q - Roll, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10715\/UnDmdi8aH5sN79-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Adventure Games"},{"name":"Fighting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Revenge and Justice","url":"https:\/\/distribution.gameflare.com\/embed\/revenge-and-justice\/","description":"Revenge and Justice is a gripping tale of vengeance, survival, and redemption in a world ravaged by destruction. Step into the role of Salvador, a skilled archer, as he embarks on a perilous journey through ruined cities reclaimed by nature, desolate wastelands, and hostile territories teeming with danger.  \r\n\r\nIn 2050, a devastating global war unleashed catastrophic weapons, triggering violent earthquakes that shattered civilization. The world was thrown into chaos, reducing humanity to scattered settlements, where survival became the only goal. Years passed, and a fragile peace settled over the remnants of society—until terror struck once again.  \r\n\r\nA chilling warning reached Salvador’s village: “Leave, or we will take this land by force.” When the villagers refused, a brutal attack left most of them dead. Against all odds, Salvador survived. Now, fueled by loss and a burning desire for justice, he sets out on a mission to confront those who shattered his world. Will vengeance consume him, or will justice prevail?","instructions":"Mouse - Shooting, WASD keys - Move, Spacebar - Jump, SHIFT - Run, R - Reload, Q - Roll, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10692\/xanQs9PKI0HCA0-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"War Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Arena Baby Tournament","url":"https:\/\/distribution.gameflare.com\/embed\/arena-baby-tournament\/","description":"Arena Baby Tournament is a fast-paced old-school shooter game inspired by classic games like \"Unreal Tournament\" and \" Quake 3 Arena\".\r\n\r\nStep back into the golden age of gaming with \"Arena Baby Tournament,\" an old-school arena third-person shooter that captures the essence of classic gameplay with a modern twist. In a dark and atmospheric world, players will engage in fast-paced combat across arenas. With an emphasis on skill-based Movement and chaotic Gunplay, \"Arena Baby Tournament\" invites you to unleash your inner champion and dominate the battlefield.","instructions":"Mouse - Shooting, WASD keys - Move, Spacebar - Jump, SHIFT - Run, E - Pick up, R - Reload, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10654\/Z5EzixzeOhZIPf-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Arena Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Legendary Archer","url":"https:\/\/distribution.gameflare.com\/embed\/legendary-archer\/","description":"Legendary Archer is a thrilling archery adventure that puts your precision and focus to the ultimate test. Set against the hauntingly beautiful backdrop of ancient castle ruins, it’s just you, your bow, and a ticking clock. With 50 levels spread across 5 stunning and increasingly challenging locations, this game keeps you on your toes as the stakes get higher with each round. Designed to push your skills to the limit, Legendary Archer combines immersive gameplay with breathtaking scenery, delivering an unforgettable experience for players of all levels. Master your aim, conquer the challenges, and become the ultimate archer!","instructions":"Mouse - Interaction","width":900,"height":535,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10431\/KgT1ydZe0OM5OD-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Archery Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Two Hands of Satan","url":"https:\/\/distribution.gameflare.com\/embed\/two-hands-of-satan\/","description":"Two Hands of Satan is a thrilling multiplayer first-person shooter that plunges players into intense, chaotic battles. This free-to-play game is designed to captivate with fast-paced, competitive gameplay, setting it apart in the shooter genre. Immerse yourself in electrifying 3v3 deathmatches, battling in vibrant arenas filled with intense action and atmospheric design. The game’s easy-to-learn controls and accessible interface make it perfect for both seasoned players and newcomers looking for adrenaline-pumping fun.\r\n\r\nWhether you’re teaming up with friends or joining players worldwide, Two Hands of Satan brings unmatched excitement with its fast rounds and strategic playstyle. With simple, intuitive mechanics, this game is optimized for anyone craving an accessible, high-energy shooter experience without the cost.","instructions":"Mouse - Shooting, WASD keys - Movement, Spacebar - Jump, SHIFT - Sprint, 1 || 4 - Change weapon, H - Medkit, T - Chat, C - Crouch, TAB - Score, ESC - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10485\/jktArhqYEuoHTy-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Multiplayer Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"The Surreptitious Operation","url":"https:\/\/distribution.gameflare.com\/embed\/the-surreptitious-operation\/","description":"The Surreptitious Operation is an intense action-adventure game that puts players in the shoes of Jack, a young and dedicated homeland security agent. Known for his patriotism and sharp instincts, Jack has quickly risen through the ranks, despite only having five years of experience. His trusted friend George, an investigative journalist, uncovers a trail of disturbing evidence linked to a powerful corporation. Alarmed, George turns to Jack for help.\r\n\r\nWhen Jack reports the findings to his superiors, he’s met with an unexpected order to drop the case. Torn between loyalty and his duty to protect his country, Jack chooses to defy the orders and secretly embarks on a dangerous solo mission to uncover the corporation’s secrets. Players must guide Jack as he infiltrates the corporation’s offices, risking everything to safeguard his country from potential threats.","instructions":"Mouse - Shooting, WASD keys - Movement, R - Reload, SHIFT - Run, C - Crouch, Q - Roll, 2 - Night vision, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10448\/uKpP5h9hkqkN9T-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Secret Agent Games"},{"name":"Shooting Games"},{"name":"Adventure Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Volunteer to the Darkness","url":"https:\/\/distribution.gameflare.com\/embed\/volunteer-to-the-darkness\/","description":"Volunteer to the Darkness is a gripping tale of survival and sacrifice, following Jose, a young man from South America, as he embarks on a perilous journey to the United States in search of a better life with his love, Lucia. Upon arriving in Los Angeles, Jose is met with harsh realities and endless obstacles, but the promise of U.S. citizenship drives him forward. His opportunity comes through an offer to join the military, but the path is deadly. Forced into a brutal competition known as \"The Crucible,\" Jose's determination is further tested when he learns that Lucia has been kidnapped. With her life on the line, Jose must navigate the harrowing challenges ahead. Victory means freedom, failure means death.","instructions":"Mouse - Shooting, Scroll wheel - Change weapon, WASD keys - Movement, Spacebar - Jump, R - Reload, F - Pick up, SHIFT - Run, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10414\/22dml5zgV2oBwo-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Seeking Justice In The Galaxy","url":"https:\/\/distribution.gameflare.com\/embed\/seeking-justice-in-the-galaxy\/","description":"Seeking Justice In The Galaxy is an epic game tale set in the aftermath of a cataclysmic world war in 2070, which left Earth ravaged and uninhabitable. Survivors ventured into space, forming a peaceful union on habitable planets. However, after nearly a century of tranquility, a coalition of three planets called the \"Atlantic League,\" shattered the peace. They trained formidable military forces and unleashed chaos, enslaving planets and looting resources.\r\n\r\nOne planet, Resistentia, refused to surrender and fought back fiercely, managing to repel the invaders. Determined to prevent future attacks, Resistentia's leaders planned a daring commando operation. They dispatched their best soldier, Darius, on a covert mission to neutralize strategic targets across the three hostile planets. Darius, aboard a stealth ship, embarks on a high-stakes journey to restore peace and justice in the galaxy.","instructions":"Mouse - Shooting, Scroll wheel - Change weapon, WASD keys - Movement, Spacebar - Jump, R - Reload, F - Pick up, SHIFT - Run, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10357\/3JpaAgKYrqb84R-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Robot wars : Rise of Resistance","url":"https:\/\/distribution.gameflare.com\/embed\/robot-wars-rise-of-resistance\/","description":"In the year 2100, Fifteen years after the devastating Third World War, the once great cities of Earth lay in ruins. Most of the population had been annihilated, and a few thousand numbers of survivors struggled to live. A group of wealthy elites, who had sheltered in their expensive bunkers during the war, emerged and established a colonial government, exploiting the remnants of humanity. They recruited a legion of ruthless mercenary soldiers, enforcing their rule with brutal repression.\r\n\r\nA small group of people, want to fight back against the colonialists and restore freedom to the world. They formed a resistance movement and began to gather support from the oppressed people. Among the rebels, a group of engineers and scientists had embarked on a daring project: the creation of a combat robot capable of turning the tide of the conflict. Day and night, they worked tirelessly, pooling their knowledge and resources. The Resistance Coalition embarked on a series of missions to weaken the colonial government's grip on power. Their first objective was to liberate the city of New Hope, a once vibrant metropolis now under the occupation of the enemy's forces.","instructions":"Mouse - Shooting, WASD keys - Movement, Spacebar - Jump, SHIFT - Run, R - Reload, E - Pick up, Q - Roll, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10347\/ksRBexcXRntQZv-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Robot Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Tiger Family Simulator","url":"https:\/\/distribution.gameflare.com\/embed\/tiger-family-simulator\/","description":"Tiger Family Simulator is a captivating game where you complete quests and level up to start and nurture your tiger family. Hunt and explore together in a vast, snowy forest, enhancing your family's traits to stay the strongest. With intuitive joystick controls, guiding your tiger is simple and realistic.\r\n\r\nChoose unique breeds for each family member, each with distinct characteristics, adding depth to your gameplay. Engage in a wide variety of quests and upgrade your tiger's energy, health, and attack power to survive against predators.\r\n\r\nEncounter diverse creatures and formidable bosses on your journey through a meticulously detailed open world. Enjoy daily gifts for consistent play and immerse yourself in a stunning environment. Experience the thrill of the wild in the Tiger Family Simulator!","instructions":"Mouse - Attack, WASD keys - Movement, Spacebar - Jump, SHIFT - Run, E - Action","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10346\/RLGJbzyUkQnnci-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Hunting Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Survival games"}]}},{"game":{"title":"Wolf Family Simulator","url":"https:\/\/distribution.gameflare.com\/embed\/wolf-family-simulator\/","description":"Wolf Family Simulator is an action game where you live the life of a wolf in a captivating autumn forest. Embark on thrilling hunts, explore diverse locations, and build a formidable wolf pack.\r\n\r\n<h3>Create a Wolf Family<\/h3>\r\nStart by finding a mate at level 10 to assist in battles and protect against forest dangers. Reach level 20 to introduce a cub and tackle challenges together.\r\n\r\n<h3>Enhance Survival Skills<\/h3>\r\nDevelop vital survival skills to protect your family. Boost health, energy, and damage stats for you and your wolf pack.\r\n\r\n<h3>Unlock Diverse Wolf Breeds<\/h3>\r\nBegin as a basic wolf and unlock breeds like the gray wolf, Indian wolf, jackal, coyote, and white wolf as you progress.\r\n\r\n<h3>Face Forest Bosses<\/h3>\r\nWatch out for powerful leaders like bears, tigers, and other wolves as you explore.\r\n\r\n<h3>Open World Adventure<\/h3>\r\nExplore a beautiful forest, gather coins, and improve survival traits.\r\n\r\n<h3>Complete Quests and Earn Rewards<\/h3>\r\nFinish exciting quests to gain experience and coins. Log in daily for special gifts!","instructions":"Mouse - Attack, WASD keys - Movement, Spacebar - Jump, SHIFT - Run, E - Eat, TAB - Menu","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10330\/npUGSdhrEZgm5i-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Hunting Games"},{"name":"Wolf Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Survival games"}]}},{"game":{"title":"Groomy Island","url":"https:\/\/distribution.gameflare.com\/embed\/groomy-island\/","description":"Groomy Island is a new horror-survival game that immerses you in a chilling 3D experience. Your primary objective is to survive while collecting 10 \"Grimace Shake\" shakes scattered across the eerie, expansive island. Follow the initial trail of light to your first shake and delve into the island's dark, deserted corners. The small map will be your guide as you navigate the treacherous terrain, ensuring you avoid succumbing to the island's horrors before completing your mission. Explore, survive, and conquer your fears in this gripping new adventure.","instructions":"Mouse - Interaction, WASD keys - Movement, Spacebar - Jump, SHIFT - Run","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10323\/Evne5dBIpmjPbq-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Adventure Games"},{"name":"HTML5 games"},{"name":"Horror Games"},{"name":"WebGL Games"},{"name":"Survival games"}]}},{"game":{"title":"The Lonesome Shooter","url":"https:\/\/distribution.gameflare.com\/embed\/the-lonesome-shooter\/","description":"In the desolate plains of Wyoming, there lived an aged cowboy named Jack. His weathered face bore the marks of a life spent in hard work, and his heart held unwavering love for his only son, Ethan, who had left the ranch to serve in the US Army.\r\nOne day, a somber knock on his door shattered his tranquility. A military officer delivered the heart-wrenching news: Ethan had been killed in action. The old cowboy's world crumbled around him, his grief threatening to consume him. Days turned into nights as Jack mourned the loss of his beloved son. But a sense of unease lingered in his mind. Rumors had reached his ears that Ethan's death may not have been as straightforward as the official report claimed.\r\nJack embarked on a solitary investigation. With the help of a former buddy, he delved into the murky depths of the conflict, seeking answers that had been deliberately concealed. Their search led them to a remote outpost where Ethan had been stationed. As they pieced together fragments of information from reluctant soldiers, a chilling truth emerged. Ethan had not died in battle but had fallen victim to a satanic ritual, a sacrifice at the hands of his own comrades.\r\nJack vowed to expose the truth and bring justice to his son's memory. He then goes to his son's mission field with the motive of revenge.","instructions":"Mouse - Shooting, WASD keys - Movement, 1 || 5 - Change weapon, SHIFT - Run, Spacebar - Jump, P - Pause, R - Reload, E - Pick up weapon","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10303\/C8oH72oj9MYOlg-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"The Scythian Warrior","url":"https:\/\/distribution.gameflare.com\/embed\/the-scythian-warrior\/","description":"In the golden age, life was always spring. The soil was fertile and there was plenty of food. People were good and happy and old age came late. They were constantly in pleasant and free air and knew neither war nor poverty. Then came the Silver Age. Hunger and cold prevailed. People became selfish and divided. After the Silver Age, the Bronze Age came. People learned to make weapons and started to fight with each other.\r\n\r\nThe last age, the Iron Age, was the age of crime and infamy, and it was a time when mankind was completely destroyed due to greed and hatred. In the vast steppes of Scythia, a solitary warrior named Aryasp embarked on a perilous quest. Sent by his tribe's chief, he ventured into the depths of an ancient dungeon, To defeat the king who had killed many warriors.","instructions":"Mouse - Attack, WASD keys - Movement, Spacebar - Jump, SHIFT - Sprint, E - Climb up, Q - Roll, ESC - Menu","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10295\/5jvSHBgCnm6LWi-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Fighting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"The Malevolent Mansion of Evil","url":"https:\/\/distribution.gameflare.com\/embed\/the-malevolent-mansion-of-evil\/","description":"In the game The Malevolent Mansion of Evil, players become brave police officers investigating a chilling crime within a foreboding gothic mansion. As darkness descends, they navigate shadowy corridors, uncover sinister secrets, and confront spine-tingling horrors. The beautifully rendered gothic environment immerses players in an eerie world with intricate architecture, flickering candlelight, and foreboding ambiance. Ghostly apparitions, malevolent spirits, hidden traps, and macabre puzzles await discovery. Armed with only a gun, players must unravel the mansion’s dark past while contending with dread. Can you survive the horrors within? 🕯️🔍","instructions":"Mouse - Shooting, WASD keys - Movement, 2 || 4 - Change weapon, R - Reload, F - Pick up weapon, SHIFT - Run","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10260\/KruS750ESUIlRs-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"Horror Games"},{"name":"WebGL Games"}]}},{"game":{"title":"A Snipers Vengeance","url":"https:\/\/distribution.gameflare.com\/embed\/a-snipers-vengeance\/","description":"This game, set in the backdrop of the Vietnam War, follows the journey of Linh, a young girl who joins the Vietnamese Army and trains to become a sniper, determined to avenge.\r\n\r\nAs players step into the shoes of Linh, they will experience a simple storyline filled with intense action gameplay. The game offers a unique perspective on the war, as players witness it through the eyes of a female protagonist who is not only fighting for her country but also for her personal vendetta.","instructions":"Mouse - Shooting, WASD keys - Movement, R - Reload, 1 || 2 - Change weapon, SHIFT - Run, P - Pause, CTRL - Crouch","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10226\/2jiNQi8Yr1gOO3-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"War Games"},{"name":"Shooting Games"},{"name":"Sniper Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Bullet and Cry in Space","url":"https:\/\/distribution.gameflare.com\/embed\/bullet-and-cry-in-space\/","description":"Experience the ultimate thrill with our action horror first-person shooter game set in a dark spaceship. Immerse yourself in an adventure as you navigate through the eerie corridors of a dark spacecraft. With realistic graphics and intense sound effects, you'll feel like you're truly trapped in this terrifying world. As you make your way through the ship, you'll encounter gruesome creatures lurking in the shadows, you must fight for humanity and uncover the mysteries of the abandoned vessel. Be prepared for intense battles and scares as you uncover the dark secrets hidden within the spaceship.\r\n\r\nWith a combination of action, horror, and first-person shooter elements, this game is perfect for horror enthusiasts.","instructions":"Mouse - Shooting, WASD keys - Movement, R - Reload, 2 || 3 || 4 - Change weapon, SHIFT - Run, F - Pick up weapon, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10222\/FWK7ZX8W9bXcSx-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Space Games"},{"name":"HTML5 games"},{"name":"Horror Games"},{"name":"WebGL Games"}]}},{"game":{"title":"Muscle Clicker: Gym Game","url":"https:\/\/distribution.gameflare.com\/embed\/muscle-clicker\/","description":"Experience Muscle Clicker: Gym Game, transforming a skinny figure into a muscular powerhouse through rigorous gym routines. Initially weak, your character struggles with basic exercises but progresses by earning money through training and competitions. Manage stamina wisely; as you exercise, funds accumulate to purchase better equipment, enhancing muscle, wealth, and experience. With gained expertise, bolster strength and endurance.\r\n\r\nThis game mirrors real-life dedication—hard work yields success. Enjoy simple controls, diverse equipment, and customizable features including physical appearance and music choices. Witness real-time muscle growth and earn status points for each level completed. Unleash your inner muscle-building champ!","instructions":"Mouse - Interaction","width":400,"height":685,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10195\/k1vJHDqki2BNpD-400-300.jpg"}],"categoryList":[{"name":"Training Games"},{"name":"Upgrade Games"},{"name":"HTML5 games"}]}},{"game":{"title":"Darkness in spaceship","url":"https:\/\/distribution.gameflare.com\/embed\/darkness-in-spaceship\/","description":"The story takes place in the future when the Earth has become uninhabitable and other planets are not suitable for life, so humanity lives only in large spaceships. The hero lives in a spaceship called Light and is a special agent. One day their ship is attacked by enemies. Enemies first bring monsters into the ship and then send robot soldiers. The hero must destroy the enemies and save his people.","instructions":"Mouse - Shooting, Scroll wheel - Change weapon, WASD keys - Movement, SHIFT - Run, R - Reload, ESC - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10180\/Zz8QBycoXBDSza-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Future Games"},{"name":"Alien Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Would You Rather?","url":"https:\/\/distribution.gameflare.com\/embed\/would-you-rather\/","description":"\"Would You Rather?\" stands as the quintessential group game for friends, offering an exciting array of over 120 thought-provoking questions. It's the ideal addition to any gathering, providing a perfect platform for social amusement. This party app promises an engaging experience, catering to both small groups and family settings, fostering shared moments of laughter and discussion. Its offline functionality adds to its versatility, transforming tedious road trips into engaging sessions filled with friendly debates and amusement.\r\n\r\nDelve into a myriad of challenging \"Would You Rather?\" scenarios, spanning from the squeaky-clean to the daringly risqué, poised to challenge and entertain your circle of friends and loved ones. Will you conquer them all? This game sets the stage for an enjoyable and interactive experience, offering endless possibilities for lively conversations and unforgettable moments.","instructions":"Mouse - Interaction","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10162\/UMH2wk6Zh04PeW-400-300.jpg"}],"categoryList":[{"name":"Puzzle Games"},{"name":"HTML5 games"}]}},{"game":{"title":"TOGETHER","url":"https:\/\/distribution.gameflare.com\/embed\/together\/","description":"Experience the exhilarating journey of TOGETHER, a captivating Platformer game that challenges you to navigate through obstacles by seamlessly switching between multiple players. Strategize and collaborate to conquer each level, utilizing the unique abilities of each character to progress through the mesmerizing black and white 2D world. Engage in a thrilling adventure where teamwork is paramount, as you leap, solve puzzles, and overcome hurdles by swiftly transitioning between players. TOGETHER offers an immersive gameplay experience, blending intriguing mechanics with visually stunning environments.","instructions":"Arrow keys - Movement, Spacebar - Jump, E - Switch, R - Restart","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10123\/R9RrrIyYaTjnr1-400-300.jpg"}],"categoryList":[{"name":"Puzzle Games"},{"name":"Jumping Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"The Resistance Fighters","url":"https:\/\/distribution.gameflare.com\/embed\/the-resistance-fighters\/","description":"The story of the game is about a young man who defends his country against enemies' invasion.\r\n\r\nIsa is a young man who was born in America. His parents are Palestinian Christians who immigrated to America. One day Isa sees on TV that the Israelis have attacked Palestine again. But something catches his attention. The pictures are of their ancestral village. Isa's grandfather and some of their relatives still live there. Isa, who is impatient, decides to go to Palestine. He buys a plane ticket at the first opportunity and goes to Jordan and enters Palestine through there.","instructions":"Mouse - Shooting, WASD keys - Movement, Spacebar - Jump, SHIFT - Run, C - Crouch, E - Step up, R - Reload, Q - Roll, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10151\/ahvRGLknsPFx37-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Assault on the Evil Star","url":"https:\/\/distribution.gameflare.com\/embed\/assault-on-the-evil-star\/","description":"In the twenty-second century, advanced technology has made life possible on planets across the galaxy. There are many constructions on different planets and many people live on other planets. All humans live under the nationwide empire of a king named Dara.\r\nThe protection of the people is done by a special army called immortals, who have been genetically modified into superhumans and have much higher power than ordinary people. Their wounds will heal on their own. The emperor has a queen named Esther, who has created many organizations on different planets using her political position.\r\n\r\nOne day, a special force of immortals is called to Queen Esther. He has done the most difficult missions so far. The queen orders him to go to one of her facilities on a planet where experiments are going out of control. He must rescue and bring the project manager from there.","instructions":"Mouse - Shooting, WASD keys - Movement, Spacebar - Jump, R - Reload, SHIFT - Sprint, Q - Roll, ESC - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10144\/VdtbgOTQCtbqm1-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Future Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Truck and Police","url":"https:\/\/distribution.gameflare.com\/embed\/truck-and-police\/","description":"A truck driver protest has taken place in Canada, and three friends have decided to join the protest. They have to go to the protest site before being arrested by the police. Jack, a former Army member who fought in NATO, seeks freedom in Canada after failing to bring freedom to the Middle East.","instructions":"Arrow keys - Driving, Spacebar - Nitro","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10124\/c82bChkSLm6sHq-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"Police Chase Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Parkour World","url":"https:\/\/distribution.gameflare.com\/embed\/parkour-world\/","description":"Welcome to Parkour World, an exhilarating Minecraft-inspired parkour game that promises both thrilling challenges and delightful gameplay. Each level in this game boasts its own distinct and innovative features, ensuring a fresh and exciting experience every time you play. While the initial levels may seem relatively simple, brace yourself for an escalating difficulty curve as you progress through the game. By the time you conquer the first ten levels, you'll find yourself facing increasingly demanding obstacles, making for an even more exhilarating adventure. Get ready to leap, run, and conquer in Parkour World!","instructions":"Mouse - Inetraction, WASD keys - Movement, Spacebar - Jump, SHIFT - Run, E - Open the treasure","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10122\/rhWZLG3GLC3SCP-400-300.jpg"}],"categoryList":[{"name":"Jumping Games"},{"name":"3D Games"},{"name":"Obstacle Games"},{"name":"Minecraft Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Skibidi Online","url":"https:\/\/distribution.gameflare.com\/embed\/skibidi-online\/","description":"Skibidi Online is a fast-paced 3D multiplayer shooter game where you can defend against attacking Skibidi Toilets in PvP or CO-OP mode. Choose from a variety of melee and ranged weapons to take down your opponents, and use your skills and teamwork to survive.\r\n\r\nThe game features 10 different maps, each with its own unique challenges. You'll need to use all of your cunning and agility to stay alive in the face of overwhelming odds. The game is easy to learn but difficult to master. Whether you're a seasoned FPS player or a complete beginner, Skibidi Online is sure to provide hours of fun.\r\n\r\nIf you're looking for a challenging and exciting multiplayer shooter game, then Skibidi Online is the game for you. Download it today and start the battle!","instructions":"Mouse - Shooting, WASD keys - Movement, Spacebar - Jump, E - Equip, TAB - Stats","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10113\/zJ5qAZK4yhqp5e-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Funny Games"},{"name":"3D Games"},{"name":"Multiplayer Games"},{"name":"Shooting Games"},{"name":"HTML5 games"}]}},{"game":{"title":"Kurofune Samurai","url":"https:\/\/distribution.gameflare.com\/embed\/kurofune-samurai\/","description":"Kurofune Samurai is a free third-person action samurai game set in 19th-century Japan. The story is about a samurai who is called to help by the people of an oppressed village. His goal is to take the rights of the people from the oppressive ruler and fight with the ruler's guards and ninjas .\r\n\r\nThe people of Shizukana had a good life. The lord who ruled over them acted justly. One day a delegation from the American government asked for a trade agreement with the lord of the region, but he refused. The Americans equipped the lord's brother Akumo and incited his brother against him. With the help of American military weapons, he won and ruled Shizukana. Akumo was a stubborn and violent man, and his oppression of the people of Shizukana gradually increased. He had enslaved the people and anyone who could not provide the required product was severely and cruelly punished. Exhausted, the people decide to ask an old samurai for help. After hearing about the oppression, the samurai agreed to help and set out to investigate and rescue the villagers.","instructions":"Left mouse button - Attack, Scroll wheel - Secondary attack, Right mouse button - Lock on target, WASD keys - Movement, E - Block, Q - Roll, P - Pause, SHIFT - Run","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10106\/VxUjvDVmE9aQ9I-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Adventure Games"},{"name":"Fighting Games"},{"name":"Samurai Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Only Up! Parkour","url":"https:\/\/distribution.gameflare.com\/embed\/only-up-parkour\/","description":"Only Up! Parkour is an exciting arcade game in which you have to overcome obstacles and conquer heights. Inspired by the popular game, your task is to guide the character through a vertical labyrinth full of various obstacles. You must react quickly, jump accurately and climb up dexterously to avoid crashing into obstacles and falling down. As you progress through the various levels, you will encounter increasing difficulty and new challenges such as moving platforms and rotating obstacles.","instructions":"Mouse - Interaction, WASD keys - Movement, Spacebar - Jump","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10105\/DE1mtdgBM4PDIr-400-300.jpg"}],"categoryList":[{"name":"Jumping Games"},{"name":"3D Games"},{"name":"Parkour Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"A Visit to Hell","url":"https:\/\/distribution.gameflare.com\/embed\/a-visit-to-hell\/","description":"A Visit to Hell is a first-person platformer game with beautiful low-poly graphics. The game features a challenging level design that will test your platforming skills to the limit. You play as a wounded NATO soldier who is in a state between life and death. Your soul enters the afterlife, where you must navigate a series of dangerous obstacles to reach the exit. Along the way, you will see the fate of others who have died, and you will learn about the true meaning of hell.\r\n\r\nThe game's low-poly graphics are stunning, and they perfectly capture the eerie atmosphere of the afterlife. The level design is also well-crafted, and it offers a good balance of challenge and excitement. The gameplay is simple to learn but difficult to master, and it will keep you entertained for hours on end.","instructions":"Mouse - Interaction, WASD keys - Movement, Spacebar - Jump, SHIFT - Run, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10098\/kXBUM6bLsGdRmu-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Adventure Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Board Boss","url":"https:\/\/distribution.gameflare.com\/embed\/board-boss\/","description":"Play this fun and popular game in your browser. Buy houses and land, rent them out and just watch how your empire grows. In this game you only play against two opponents controlled by the computer. But it doesn't mean that the game is boring! It's great fun and it will be a good training if you later want to play against friends.\r\nBoard Boss is fan-made version of popular game Monopoly.","instructions":"Mouse - Interaction","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10090\/4lYjRdZ0W4K1Ds-400-300.jpg"}],"categoryList":[{"name":"Puzzle Games"},{"name":"Strategy Games"},{"name":"Two players games"},{"name":"Company Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"3+ Player Games"}]}},{"game":{"title":"Park It","url":"https:\/\/distribution.gameflare.com\/embed\/park-it\/","description":"Park It is a challenging and addictive car parking game designed for lovers of the genre. In this game, you can improve your driving skills by learning how to park your car in a variety of challenging situations. You will also learn about different traffic signs, which will help you in real life.\r\n\r\nThe game features many levels, each with its own unique challenges. You will need to avoid hitting obstacles, pass driving school tests, and park your car in tight spaces. As you progress through the levels, the challenges will become more difficult.\r\n\r\nIn addition to the challenging gameplay, Park It also features stunning graphics and realistic physics. You will feel like you are actually driving a car as you maneuver through the levels.","instructions":"WASD keys - Driving, Spacebar - Handbrake","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10085\/rSDkmwphJhs2Kg-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Parking Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Evil Space Base : FPS","url":"https:\/\/distribution.gameflare.com\/embed\/evil-space-base-fps\/","description":"Evil Space Base : FPS is an action game that is set in a sci-fi space base. You play as a space patrol who finds a mysterious base on a remote planet and goes to inspect it. But soon you discover that this base has a big secret and terrible events have happened in it. The game features intense action horror gameplay, a beautiful and atmospheric sci-fi environment, an entertaining and simple story, and good graphics.\r\nPlay Evil Space Base : FPS today and experience the thrill of exploring a dark and dangerous space base!","instructions":"Mouse - Shooting, Scroll wheel - Change weapon, WASD keys - Move, R - Reload, SHIFT - Run, ESC - Menu","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10084\/AHcCH3CXCiWGmN-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Space Games"},{"name":"Alien Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"The Courage of an American Grandfather","url":"https:\/\/distribution.gameflare.com\/embed\/the-courage-of-an-american-grandfather\/","description":"The Courage of an American Grandfather is a captivating free-to-play fighting game that combines the allure of modern graphics with the nostalgic essence reminiscent of timeless classics such as Streets of Rage and Final Fight.\r\n\r\nMeet John, an elderly martial arts master who proudly runs a gymnasium in a quaint town. His aspirations revolve around witnessing his grandson's rise to greatness as a phenomenal athlete, ultimately bringing glory to the United States in the global championship. However, an unforeseen turn of events occurs when a rival martial arts club attempts to obliterate everything John holds dear. It is now up to this seasoned warrior to face the odds and emerge victorious. Join forces with the aging hero as he embarks on an exhilarating battle against formidable adversaries. Together, let us assist this remarkable elderly gentleman in achieving triumph.","instructions":"Arrow keys - Movement, X - Punch, Z - Kick, Spacebar - Jump","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10077\/fUSTO2eWQpXYPj-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Fighting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"A Rifleman From Ireland","url":"https:\/\/distribution.gameflare.com\/embed\/a-rifleman-from-ireland\/","description":"A Rifleman From Ireland is a thrilling 3D action game that puts you in the shoes of an Irish soldier defending his homeland from invading enemies. Immerse yourself in intense and exhilarating third-person shooter gameplay as you navigate a stunning environment. The game offers an entertaining and straightforward storyline, complemented by captivating graphics that bring the world to life. Experience the excitement of being a Rifleman From Ireland as you embark on this epic adventure.","instructions":"Mouse - Shooting, WASD keys - Move, R - Reload, SHIFT - Run, Spacebar - Jump, C - Crouch, Q - Roll, ESC - Menu","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10064\/kkKcBoJzBCLJNN-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"War Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Soldier of Homeland: Sahara","url":"https:\/\/distribution.gameflare.com\/embed\/soldier-of-homeland-sahara\/","description":"Soldier of Homeland: Sahara is an action-shooting game with great 3D graphics. A country in North Africa is suffering from drought and lack of water. People are facing difficulties in their lives. But other countries offer help and in the beginning, the water problems get a little better. Unfortunately, various diseases spread in the country, and the situation is very critical. People have realized that these diseases are due to experiments on them, but the authorities do nothing. A patriotic soldier decides to attack the enemy base alone and destroy their laboratory. Save your country and your people in this game.","instructions":"Mouse - Shooting, WASD keys - Move, R - Reload, SHIFT - Run, Spacebar - Jump, C - Crouch, Q - Roll, ESC - Menu","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10043\/vxSxKgG1MRHOPt-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"War Games"},{"name":"Shooting Games"},{"name":"Adventure Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"In Search of Wisdom and Salvation","url":"https:\/\/distribution.gameflare.com\/embed\/in-search-of-wisdom-and-salvation\/","description":"Following a devastating global war in 2050, the majority of Earth's population perished, leaving only a small group of survivors. One such tribe sought to create a brighter future by learning from humanity's past mistakes. Recently, a mystic individual discovered a valuable book that could serve as a guide for the tribe. Unfortunately, the occupiers took control of the area where the man was last seen. To retrieve the book and locate the man, the tribe dispatches a robot to the area. The robot's mission is to find the man and bring back the book to aid in the tribe's efforts towards a better future.","instructions":"Mouse, WASD keys - Movement, SHIFT - Run, Spacebar - Jump \/ push box, E - Interaction, C - Crouch, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10019\/7eNyFomLC97573-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Robot Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Survival games"}]}},{"game":{"title":"Wounded Summer Baby","url":"https:\/\/distribution.gameflare.com\/embed\/wounded-summer-baby\/","description":"Wounded Summer Baby Edition is an action-packed shooter game set in the wild west, boasting stunning graphics. The protagonist of the story is an infant named Tecumseh, who hails from a Native American tribe. Tragedy strikes when Tecumseh's tribe is brutally attacked, resulting in the loss of his fellow tribesmen and the abduction of his sister. Determined to seek justice and rescue his sister, Tecumseh sets out on a treacherous quest, navigating through perilous terrain and facing formidable foes along the way. Players will join Tecumseh in his courageous journey to avenge his tribe and save his sister in this thrilling and emotionally charged game.","instructions":"Mouse - Shooting, WASD keys - Movement, Spacebar - Jump, SHIFT - Run, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/10007\/BNCBqccnJOw9Jn-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Archery Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Survival games"}]}},{"game":{"title":"Alone In The Evil Space Base","url":"https:\/\/distribution.gameflare.com\/embed\/alone-in-the-evil-space-base\/","description":"Alone In The Evil Space Base is a third-person action horror game that takes place in a dark space base. The game’s story revolves around a space patrol that discovers a mysterious base on a remote planet and decides to investigate it. However, the base has a big secret, and terrible events have occurred there. The game features intense action horror gameplay, a beautiful and atmospheric sci-fi environment, and an entertaining and straightforward story. The game is sure to keep you on the edge of your seat with its thrilling gameplay and eerie atmosphere.","instructions":"Mouse - Shooting, WASD keys - Move, R - Reload, SHIFT - Run, Spacebar - Flashlight \/ push, ESC - Menu","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9990\/SISDGc7FoBXtjm-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Future Games"},{"name":"Alien Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Soldier Of The Homeland","url":"https:\/\/distribution.gameflare.com\/embed\/soldier-of-the-homeland\/","description":"In Eastern Europe, a terrorist group has launched an attack on a country, prompting its citizens and military to engage in combat. Meanwhile, the United States military has arrived in the country, claiming to assist in the fight against terrorism. However, suspicions arise that the true motive behind their presence is to exploit the country's mineral resources. In the midst of this turmoil, a ranger named Niko finds himself torn between defending his nation against both the terrorists and the US occupation. Driven by a desire for liberation, Niko decides to take up arms and fight for his country's freedom.","instructions":"Mouse - Shooting, WASD keys - Move, R - Reload, SHIFT - Run, Spacebar - Jump, C - Crouch, Q - Roll, ESC - Menu","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9971\/OvYnyxihUWsWBN-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"War Games"},{"name":"Shooting Games"},{"name":"Adventure Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Swordsman of Persia","url":"https:\/\/distribution.gameflare.com\/embed\/swordsman-of-persia\/","description":"Swordsman of Persia: Ancient Story transports players back to ancient Persia through a captivating and immersive third-person action platformer experience. As the protagonist, Bahram, players will embark on a journey filled with adventure and excitement as they strive to avenge the massacre of their town, Khavarshahr, and rescue the captive citizens, including the beloved king's daughter. The invasion of Bahram's hometown by ruthless invaders has resulted in widespread destruction and loss of life. Driven by the need to seek revenge and free his people, Bahram sets out on a quest that will test his skills and determination. With beautiful graphics and a thrilling storyline, Swords of Persia: Ancient Story is a must-play for anyone who loves action games set in historical environments.","instructions":"Mouse - Attack, WASD keys - Movement, SHIFT - Run, Spacebar - Jump, E - Interaction, P || ESC - Menu","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9953\/GDvSonlOsqC0OH-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Adventure Games"},{"name":"Fighting Games"},{"name":"HTML5 games"},{"name":"Historical Games"},{"name":"WebGL Games"}]}},{"game":{"title":"My Land: King Defender","url":"https:\/\/distribution.gameflare.com\/embed\/my-land-king-defender\/","description":"As a king, you have been bestowed with the responsibility of protecting your kingdom from monster attacks. In order to do so, you must strive to expand your kingdom by purchasing new lands, gathering resources, and selling them to earn gold. With this gold, you can upgrade your tools, build towers for defense, and find hidden chests to gain valuable resources. By utilizing these resources and tools, you can create a great and beautiful kingdom, solidifying your role as a true king who is dedicated to the preservation of his land. Remember, your ultimate goal is to save your kingdom, and it is up to you to make it happen. Take charge and build a kingdom that will be remembered for generations to come.","instructions":"Mouse - Movement","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9945\/FKi2m8qxNS1Wa2-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Adventure Games"},{"name":"Building Games"},{"name":"Collection Games"},{"name":"Knight Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Black Apocalypse","url":"https:\/\/distribution.gameflare.com\/embed\/black-apocalypse\/","description":"The year 2050 marked the beginning of a global conflict that utilized weapons of mass destruction, leading to widespread destruction and loss of life on a massive scale. Many people died from the direct effects of the war, while others succumbed to disease and starvation.\r\nDespite this catastrophic event, humanity eventually managed to rebuild and the population started to grow once again. New communities were established in areas of the world that had not been affected by the war.\r\nIn this game, you will play as a hero from a village that has recently been attacked by wolves. Your objective is to protect your fellow villagers and navigate this perilous world in order to survive. Good luck on your journey.","instructions":"Mouse - Attack, WASD keys - Movement, SHIFT - Run, Spacebar - Jump, E - Interaction, P || ESC - Menu","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9919\/1qn8JCtGl7nKJF-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Fighting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Gibbets: Bow Master","url":"https:\/\/distribution.gameflare.com\/embed\/gibbets-bow-master\/","description":"Gibbets: Bow Master is a fun and challenging online game where players must use their archery skills to save people from being hanged. The game features various levels, each with a different set of challenges and obstacles that players must overcome.\r\nIn each level, players must use their bow and arrow to cut the rope holding up a person who has been hanged. However, players must be careful not to accidentally hit the person they are trying to save, as this will result in a game over. To make things even more challenging, players must also navigate various obstacles such as wind, moving platforms, and blocks, all while trying to make the perfect shot.","instructions":"Mouse - Interaction","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9917\/uUNqz79e8iyvyo-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"Rescue Games"},{"name":"Archery Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Black Soldier of Rome","url":"https:\/\/distribution.gameflare.com\/embed\/black-soldier-of-rome\/","description":"Black soldier of Rome is a fighter game where you will be playing as an African warrior serving within the Roman army. He’s an older soldier who has been promoted to the post of commander. His mission is to attack enemy tribes that find themselves to the north of Rome. However, on his way there, his whole unit has been slain and he stands alone. The mission has to be completed though, so be sure to help him out. Start your dangerous quests full of enemies. You will need to fight for your life throughout the whole game. Be sure to try this one out!","instructions":"Left mouse button - Attack, Scroll wheel - Lock on target, Right mouse button - Block, WASD keys - Movement, SHIFT - Run, Q - Roll, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9904\/kOWHilWMZzhAnf-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Adventure Games"},{"name":"Fighting Games"},{"name":"HTML5 games"},{"name":"Historical Games"},{"name":"WebGL Games"}]}},{"game":{"title":"Mini Samurai Kurofune","url":"https:\/\/distribution.gameflare.com\/embed\/mini-samurai-kurofune\/","description":"Mini Samurai Kurofune is a story of a samurai who is called up by people from an exploited village. One day, a delegation from America has arrived that wanted to strike a business deal with them. The ruler has rejected this partnership. The Americans then joined forces with the rulers brother Akumo and started a war. Akumo is now the new ruler, but his cruelty is terrifying the village and the locals sent for help to a samurai - you. You’ve accepted and now start your quest to free the innocent folk.","instructions":"Left mouse button - Attack, Scroll wheel - Secondary attack, Right mouse button - Lock on target, WASD keys - Movement, E - Block, Q - Roll, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9890\/O17pjqdeGHIlcj-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Adventure Games"},{"name":"Fighting Games"},{"name":"Samurai Games"},{"name":"HTML5 games"},{"name":"Historical Games"},{"name":"WebGL Games"}]}},{"game":{"title":"Gears of Babies","url":"https:\/\/distribution.gameflare.com\/embed\/gears-of-babies\/","description":"Gears of Babies is a well made third-person shooter game where you play as Nick, a courageous baby who is trying to protect the right of babies in America! The babies are tired of waiting for a clean diaper or basic foodstuffs like milk, while the government is funding foreign wars. Your hero is therefore trying to do whatever he can to get the necessary diapers. Traverse enemy territory and kill all of your enemies that stand in your way. Pick up a gun and start shooting!","instructions":"WASD keys - Movement, Mouse - Shooting, R - Reload, C - Crouch, SHIFT - Run, Spacebar - Cover","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9879\/MMe1otm1r7rdXA-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Dinogen Online","url":"https:\/\/distribution.gameflare.com\/embed\/dinogen-online\/","description":"Dinogen Online is an online 2D multiplayer action shooter with a lot of weapons, game modes and maps. Unlock new weapons, dinosaurs, gear, items and much more by getting XP in the game! You can play either as human or as dinosaur in game modes such as Team Deathmatch, Capture the Flag or Destruction. You can play one of the many survival modes and try to withstand never-ending waves of enemies, such as militiamen, dinosaurs, helicopters and many others. Create your own maps and missions with the in-game editor. The editor is a great tool that will allow you to change already available maps and missions or create wholly new ones. All of the scenarios you make will be available right away in the game and you will be able to play them yourself or with friends online.","instructions":"Mouse - Shooting, WASD keys - Movement, SHIFT - Sprint, CTRL - Crouch, E - Interaction, R - Reload, Spacebar - Melee, G - Grenade, F - Use equipment, Q - Switch weapon, TAB - Scoreboard, Enter key - Chat","width":1280,"height":755,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9835\/BmJskWnl9zs5b4-400-300.png"}],"categoryList":[{"name":"Action Games"},{"name":"Multiplayer Games"},{"name":"Shooting Games"},{"name":"Arena Games"},{"name":"Dinosaur Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Arena Heroes Tactics!","url":"https:\/\/distribution.gameflare.com\/embed\/tournament-heroes-online\/","description":"Hire, teach and equip warriors, customize and manage your own unique squad to explore Catacombs and fantasy Dungeons! Build the strongest team, create more combinations and make your personal strategy and fight against other players online on PvP Arena battles like traditional MOBA. Play Tournaments, take rewards and win epic chests in Championships! Challenge top players in online leaderboards! Or simple collect rewards from Dungeons, complete special Events and raid the Bosses - just chill out.","instructions":"Mouse - Interaction","width":960,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9795\/7q6srttV4bM08G-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"Fighting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Mini Colony","url":"https:\/\/distribution.gameflare.com\/embed\/mini-colony\/","description":"Mini Colony is yet another online game from the series, this time you’ll be building up your own small colony. You find yourself on arid islands, so survival won’t be that easy. Right at the beginning you will get 3 workers helping you out (they can chop wood for instance). Thanks to them, you will be able to enlarge your colony and buy new tools. The wood itself won’t be enough and you’ll have to find other resources that will allow you to thrive. Food is also very important, so be sure to quickly set up a farm and care for your animals. There’s a ton of options, so don’t worry about getting bored.","instructions":"Mouse - Interaction, Scroll wheel - Zoom, WASD keys - Movement, Q || E - Rotate camera","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9797\/JAazjylEIycK1f-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"3D Games"},{"name":"Farm Games"},{"name":"Building Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Security Breach","url":"https:\/\/distribution.gameflare.com\/embed\/security-breach\/","description":"Security Breach is a horror FNAF game where you will be trying to survive. Right at the beginning, you will be able to pick from 2 stories and multiple settings. After that, the true danger starts. You are locked in a room and need to find out how to get out. Once you manage to do that, another problem comes up - there are enemies outside who are trying to get rid of you. Be sure to move cautiously and hide whenever possible.","instructions":"Mouse - Interaction, WASD keys - Movement","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9796\/gMo5KCTxB7iBAB-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Robot Games"},{"name":"HTML5 games"},{"name":"Horror Games"},{"name":"WebGL Games"}]}},{"game":{"title":"The Patriots : Fight and Freedom","url":"https:\/\/distribution.gameflare.com\/embed\/the-patriots-fight-and-freedom\/","description":"The Patriots: Fight and Freedom is about a young woman named Ashley who is living with her husband and child in a small town in the US. One day, she hears explosions and emergency sirens. There are military vehicles in the city and the news are that a coup against the American government has been organized with the perpetrators capturing the president. Ashley grabs her weapon and joins the resistance to save her country. Help her out and see her succeed!","instructions":"WASD keys - Movement, Mouse - Shooting, C - Crouch, SHIFT - Run, Spacebar - Jump, E - Interaction, R - Reload, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9776\/rqHngH5FbzYZjY-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Adventure Games"},{"name":"Detective Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"The Letter: Seeker Of Truths","url":"https:\/\/distribution.gameflare.com\/embed\/the-letter-seeker-of-truths\/","description":"The Letter: Seeker Of Truths is a story game where you will find out at the beginning that an American journalist has been attacked. Her office has been targeted in a terrorist attack. Her objective will be to find out who wanted to kill her and who is part of this dangerous organization. Be sure to use the help of your friends who will accompany you through the game. Aside from that, there will be 3D graphics to enjoy and fun gameplay. Good luck with uncovering the truth.","instructions":"WASD keys - Movement, Mouse - Camera, C - Crouch, SHIFT - Run, Spacebar - Jump, E - Interaction, P - Pause","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9758\/fwqZaaB51v3klq-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Adventure Games"},{"name":"Detective Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Super Red","url":"https:\/\/distribution.gameflare.com\/embed\/super-red\/","description":"Super Red is a fairly difficult shooter game where you will have to use your time cautiously. You can slow down time by standing still and make it flow normally again by moving. Use this skill against your enemies. To move your character, you can use the WASD keys. While moving time will flow normally, when standing still the time will slow down. The goal of the game is to kill as many enemies as possible. They will spawn in the arena continuously. You need to always be on your toes and think about your next move.","instructions":"Mouse - Shooting, WASD keys - Movement","width":800,"height":485,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9742\/mJWCCAhPfqwlDq-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Shooting Games"},{"name":"HTML5 games"}]}},{"game":{"title":"Squad Hero Tower","url":"https:\/\/distribution.gameflare.com\/embed\/squad-hero-tower\/","description":"Squad Hero Tower is a mixed action and puzzle game where you will have to put your hero into a tower and fight against enemies who are dressed similarly to Squad Game. The objective of your hero will be to kill all enemies around. To do so, he has to have a higher number than the enemy. For each kill, the number of your hero will increase and you can move to other parts of the tower. Like this, you can destroy all of your opponents and win the level. The game offers a total of 40 levels, so don’t worry about getting bored soon. For the money you earn, you will be able to purchase new skins.","instructions":"Mouse - Interaction","width":800,"height":535,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9732\/XXj6xHixYVx5YP-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Puzzle Games"},{"name":"Fighting Games"},{"name":"HTML5 games"}]}},{"game":{"title":"City Blocks","url":"https:\/\/distribution.gameflare.com\/embed\/city-blocks\/","description":"City Blocks is a logical puzzle game where you will be connecting 3 buildings of the same type in order to build a new, larger building. You can continue to do so for as long as you have space to build these buildings, because once you start running low on real estate, the game will get much more difficult. You receive a Joker during the game that can help you out in this situation. It can be used to buy a building of a specific type that you need to combine with 2 others in order to free some space. The larger your city will become, the higher your score will get, so be sure to aim high.","instructions":"Mouse - Interaction","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9726\/ezvbjrBuzW0jG8-400-300.jpg"}],"categoryList":[{"name":"Puzzle Games"},{"name":"3D Games"},{"name":"Connect Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Merge Games"}]}},{"game":{"title":"Let's Fart Brandon","url":"https:\/\/distribution.gameflare.com\/embed\/let-s-fart-brandon\/","description":"Let's Fart Brandon: Browser is a free funny action\/comedy game featuring Mr Biden and his infamous farts.\r\n\r\nThe Story: Mr. Biden falls asleep at a conference and has nightmares. In the world of his nightmare, his only weapon is fart.\r\n\r\nGame Features:\r\nFunny top down actin horror\/comedy gameplay\r\nEasy to pick up and play\r\nFor fans of fun and comedy games\r\nSuitable for both female and male players\r\nGood graphic with stable performance on older PCs\r\nUnique surreal nightmare world with sense of humor","instructions":"WASD keys - Movement, Spacebar - Fart","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9725\/iQZQGEiitosCPT-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"3D Games"},{"name":"Skill Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"House Builder","url":"https:\/\/distribution.gameflare.com\/embed\/house-builder\/","description":"House Builder is a very simple online game where you won’t be tasked with any super complicated tasks. Right at the start of the game, you will be presented with an empty space where you’ll be able to build the building of your dreams. Start with the walls that have to have the correct shape and form. After that, you can start putting in accessories and furniture. Add tables, chairs, sofas, flowers, etc. You can also buy other buildings and decorate them to your liking. It’s all up to you! So come on, let’s play!","instructions":"Mouse - Interaction","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9635\/KEBxruJxxtARPn-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"3D Games"},{"name":"Building Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Mini Farm","url":"https:\/\/distribution.gameflare.com\/embed\/mini-farm\/","description":"Mini Farm is a great online game where you will be helping your little farmer take care of the whole farm. Aside from growing crops and fishing, you will have to take care of many animals, such as pigs, cows or even sheep. For the money you earn, you will be able to purchase more animals or crops and make your farm larger. Aside from that you can also improve your accommodations and buy new furniture. You earn money by selling crops and produce in the city. The game provides you with a ton of options, so be sure to explore quite a bit! We are pretty sure you won’t be bored.","instructions":"Mouse - Interaction, Right mouse button - More options in inventory, WASD keys - Movement, Q || E - Rotate camera, SHIFT - Attack","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9654\/aFHyAf29qVoL6z-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"3D Games"},{"name":"Farm Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Count Masters","url":"https:\/\/distribution.gameflare.com\/embed\/count-masters\/","description":"Count Masters is an interesting online game that is also available on mobile devices. It offers unique gameplay where your main objective will be to defeat your opponents and avoid obstacles in the process. It’s interesting in a sense that your army can only get larger by walking through a gate. The number written on the gate signifies the number by which your army will grow larger. Pick the right gate so that you get as many warriors as possible. You will need the warriors to defeat all of your enemies. So be sure to try the game out!","instructions":"Mouse - Movement","width":400,"height":685,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9650\/R6Zr5ry0oraX0K-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"Obstacle Games"},{"name":"Skill Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Octagon","url":"https:\/\/distribution.gameflare.com\/embed\/octagon\/","description":"The task in today's game will be to avoid various holes and get as far as possible. The whole game offers 1 game mode. It's an endless mode, so you'll be playing all the time. Get the ball to the goal. The level is generated automatically and is constantly changing, so you need to adjust to it. Also, the speed increases and the game will become more and more challenging. How far can you go? Write your score in the comments.","instructions":"Arrow keys - Movement","width":945,"height":625,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/5759\/WB5Cq2Jmi1SwQn-400-300.jpg"}],"categoryList":[{"name":"Jumping Games"},{"name":"3D Games"},{"name":"Observation Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Snowboard Tricks","url":"https:\/\/distribution.gameflare.com\/embed\/snowboard-tricks\/","description":"Snowboard Tricks is a rather simple game that offers you just 2 levels. The graphics are rather simple as well, but you’re able to do whatever you want with your character. You start the game on a hill and your objective is to avoid all of the obstacles coming your way and not to fall down. As you do this, you should also try to show off your tricks, such as flip, etc. It’s up to you to come up with the stunts. The controls aren’t the easiest around, but you'll surely figure them out.","instructions":"Arrow keys - Movement, Spacebar - Jump, V - Grab snowboard","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9603\/eXfjkbHpaUaDsc-400-300.jpg"}],"categoryList":[{"name":"Sports Games"},{"name":"3D Games"},{"name":"Snowboarding Games"},{"name":"Stunt Games"},{"name":"Winter Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Tavern Master","url":"https:\/\/distribution.gameflare.com\/embed\/tavern-master\/","description":"Build a tavern from the ground up in any way you imagine it! It can be a classy place meant to serve kings or a restaurant which specializes in great food. Optimize your seating arrangement to allow your staff to be as fast as possible, upgrade and expand to attract even more patrons and spread your business to include a hotel, a weapon shop and maybe even a medieval food delivery service! In order to keep your customers happy you will need to have enough food and drinks at all times, efficient staff, great decorations and proper lights. Combine all of that with your imagination and your tavern might be the best in the kingdom!","instructions":"Mouse - Interaction","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9602\/MWRmTxB0Po1RIE-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"3D Games"},{"name":"Building Games"},{"name":"Service Games"},{"name":"HTML5 games"},{"name":"Historical Games"},{"name":"WebGL Games"}]}},{"game":{"title":"Shy Eye Labyrinth: Prototype","url":"https:\/\/distribution.gameflare.com\/embed\/shy-eye-labyrinth-prototype\/","description":"You have been locked in the labyrinth with a quest. Find four keys to open a way out. Each key is hidden in a unique level. Can you discover labyrinth’s secrets, overcome it’s puzzles and find the keys?\r\nThis is just a prototype, not a fully developed game.\r\n\r\nYou can send us feedback in comments.\r\n\r\n<a href=\"https:\/\/discord.gg\/YMPTKN5\" target=\"_blank\" rel=\"noopener\" style=\"color: #ffffff; width: 350px; background-color: #7289da; padding: 20px; font-size: 24px;\"><i class=\"fab fa-discord\"><\/i> Discord<\/a>\r\n\r\n<iframe src=\"https:\/\/store.steampowered.com\/widget\/1540100\/\" frameborder=\"0\" width=\"646\" height=\"190\"><\/iframe>","instructions":"WASD keys - Movement, Spacebar - Jump, SHIFT - Run, F - Interaction, C - Teleport to centerport, ESC - Menu","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9600\/47SK2jNwlHHYLN-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Puzzle Games"},{"name":"3D Games"},{"name":"Platform Games"},{"name":"Adventure Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Fantasy Games"}]}},{"game":{"title":"The Untitled Happiness Project","url":"https:\/\/distribution.gameflare.com\/embed\/the-untitled-happiness-project\/","description":"As a worker for the Happiness corporation you are sent to the Phaseolus town to make two of its inhabitants - Jonathan Perry and Rachel Portland - happy again.\r\nFollow them during their day routine, explore the town and talk with residents to gain information which will help you solve their case and make them happy again.\r\n\r\nYou can send us feedback in comments.","instructions":"WASD keys - Movement, F - Interaction, TAB - Mindmap, P - Reset, ESC - Menu","width":900,"height":542,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9597\/dhWN9LMQU9CLhZ-400-300.jpg"}],"categoryList":[{"name":"Puzzle Games"},{"name":"Funny Games"},{"name":"3D Games"},{"name":"Adventure Games"},{"name":"Detective Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Wounded Winter: A Lakota Story","url":"https:\/\/distribution.gameflare.com\/embed\/wounded-winter-a-lakota-story\/","description":"About\r\nWounded Winter: A Lakota Story is a free action \/ shooter western game with a beautiful low poly graphic.\r\nStory\r\nThe hero of the story is called Akecheta, who is a Lakota(Native American). The Akecheta tribe is attacked and its people are killed while he is hunting. The attackers also took Akecheta's wife with them. Akecheta embarks on a perilous journey to bring his wife back and avenge the murderers of his tribe.","instructions":"Left mouse button - Shooting, Right mouse button - Aim, WASD keys - Movement, Spacebar - Jump, R - Reload, C - Crouch, Q - Roll","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9583\/MRZ3f0sVbf7BLk-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Wild West Games"},{"name":"HTML5 games"},{"name":"Historical Games"},{"name":"WebGL Games"}]}},{"game":{"title":"Deadswitch 3","url":"https:\/\/distribution.gameflare.com\/embed\/deadswitch-3\/","description":"Deadswitch 3 is a fast-paced action game where you find yourself in an arena full of enemies and your goal is to eliminate them all. You will have many modes, maps and weapons at your disposal. Since this is a multiplayer game, be sure to call a friend and play the game together!\r\n\r\nRanked\r\n- you play with real players or against bots\r\n- you can upgrade your character or its special skills\r\n- as you play through the game, you will be getting new equipment and your rank will be getting higher and higher\r\n\r\nOperations\r\n- complete missions alone or with your friends\r\n- each operation gives you different rewards\r\n\r\nSurvival\r\n- survive for as long as possible and kill all of your enemies coming in waves\r\n- become the best ranked player around.","instructions":"Mouse - Shooting, WASD keys - Movement, ESC - Menu, Spacebar - Jump, SHIFT - Sprint, CTRL - Crouch, E - Interaction, R - Reload, Q - Change weapon, V - Melee attack, Z - Special attack","width":1300,"height":755,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9561\/ofPNafwVFNCnwQ-400-300.png"}],"categoryList":[{"name":"Action Games"},{"name":"Multiplayer Games"},{"name":"Shooting Games"},{"name":"Zombie Games"},{"name":"Soldier Games"},{"name":"HTML5 games"}]}},{"game":{"title":"Mini Survival","url":"https:\/\/distribution.gameflare.com\/embed\/mini-survival\/","description":"Mini Survival is a great mini game where you'll be trying to survive for as long as possible. You start barehanded, with your first objective being to collect a few stones, some wood and other resources that can be used to create your first tools. You can therefore create an axe, a fishing rod or something to attack with, a sword for instance. You can also start a fire that you'll be grateful for during the night. If you like gardening, you can start your own farm by planting seeds. You can also hunt animals. As you can see, the possibilities are endless, and you’ll be entertained for hours.","instructions":"Mouse - Interaction, Right mouse button - More options in inventory, WASD keys - Movement, Q || E - Rotate camera, SHIFT - Attack","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9535\/MVnavWEQc1wnfg-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Farm Games"},{"name":"Fisher Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Survival games"}]}},{"game":{"title":"Business Tycoon","url":"https:\/\/distribution.gameflare.com\/embed\/business-tycoon\/","description":"Business Tycoon is a strategy game where you’ll have to build up your own store empire. You start off with a single store and you’ll have to do everything yourself. As you progress, you start buying upgrades that will improve the sum of money you earn. After a while, you can buy more upgrades or hire managers who will be taking care of the cash flow. This way, you can improve the stores and earn more revenue. The goal will be to buy up all of the stores and create an empire.","instructions":"Mouse - Interaction","width":400,"height":685,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9528\/MsPTA5BEcQWBBU-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"Company Games"},{"name":"Upgrade Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Last Debt","url":"https:\/\/distribution.gameflare.com\/embed\/last-debt\/","description":"Last Debt is an interesting simulator where you're trying to make as much many as possible to pay a really high debt. At the beginning of the game you are able to pick how high the debt will be and the time that you need to pay it in. From that stems the game difficulty. Aside from all that you need to take care of your own needs. Try to be healthy, well fed and in good condition both physically and mentally. At the beginning of the game you start in a fast food, but the game is offering you other jobs as well.","instructions":"Mouse - Interaction, WASD keys - Movement, SHIFT - Run, Spacebar - Walk, E - Use","width":960,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9512\/J9kI9zK9nOnxU4-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"Company Games"},{"name":"Service Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Stunt Destroyer","url":"https:\/\/distribution.gameflare.com\/embed\/stunt-destroyer\/","description":"Stunt Destroyer is an online game where you’ll be controlling a race car. Your objective is to gain speed on a platform. After that, try to destroy as many obstacles as you can. You will get rewarded with money that can be used to upgrade your engine or your turbo. You can also use this money to buy a new car. Your main objective will be to get to the green box. This can be done only with an upgraded car. If you reach the green box, you continue to the next level!","instructions":"Arrow keys - Driving","width":500,"height":685,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9499\/SzlsbzuKdxE126-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Destroy Games"},{"name":"Upgrade Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Save the Penguin","url":"https:\/\/distribution.gameflare.com\/embed\/save-the-penguin\/","description":"Save the Penguin is a nice little adventure game with a rather short story. Your objective is to save your friend who’s been imprisoned by evil penguins. If you want to save him, you first need to defeat the penguins. Your friend will be free only after you break his chains. In your surroundings, there will be fish that will help you gain some HP by eating them. There are also snowballs that you can use against your enemies. Move around and explore the world. Get through all of the objectives and defeat your opponents. Good luck!","instructions":"Mouse - Attack, WASD keys - Movement, Spacebar - Jump, E - Interaction, 1 || 2 || 3 - Change the item","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9491\/ZqiOAhE4q8R9wq-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Rescue Games"},{"name":"Adventure Games"},{"name":"Penguin Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Samurai Warrior","url":"https:\/\/distribution.gameflare.com\/embed\/samurai-warrior\/","description":"Samurai Warrior is an action online game where you’ll be fighting against a lot of enemies. Right at the beginning of the game, you pick a character that you’ll be playing as. You can pick between a man and a woman. While playing, you won’t be able to change your gender, so be sure to choose correctly. You can then start fighting against your enemies. There's a total of 5 levels where you’ll meet many opponents. They will all try to kill you, so be sure to watch your HP bar. Let’s try the game out!","instructions":"Arrow keys - Movement, Spacebar - Jump, Z || X - Attack, C - Defense","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9489\/rNmazeTGaZkH3g-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Fighting Games"},{"name":"Samurai Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Prison Break","url":"https:\/\/distribution.gameflare.com\/embed\/prison-break\/","description":"Prison Break is an action online game where you’ll be in control of an inmate. As the name of the game suggest, your goal will be to break out of prison. There’s a total of 15 levels waiting for you with numerous objectives, where you'll have to unlock a lock, put in the right code or get rid of guards. You always need to get to a place that has been marked on the mini map. Don’t forget that you can use your fists or a baseball bat to attack. The game offers simple gameplay with mediocre graphics, so come on!","instructions":"Mouse - Attack, WASD keys - Movement, E - Change weapon, SHIFT - Sprint, CTRL - Prone, P - Pause, L - Mouse lock","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9476\/L2ETMWRHgpcyaN-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Prison Break Games"},{"name":"Fighting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Pen Run","url":"https:\/\/distribution.gameflare.com\/embed\/pen-run\/","description":"In this game, you will be controlling a pen that you are tasked with getting to the finish line. There will be numerous obstacles waiting for you on the way that can stop you and end the game. Start playing and avoid them all! The game is offering you a fairly small playing field, so you won’t have much space to navigate through. Start playing and show everyone what you’ve got. Scout the whole level.","instructions":"Mouse - Movement","width":411,"height":685,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8784\/W0ZOGzyKHQGvyW-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"3D Games"},{"name":"Observation Games"},{"name":"Drawing Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Stickman vs Stickman 2","url":"https:\/\/distribution.gameflare.com\/embed\/stickman-vs-stickman-2\/","description":"Stickman vs Stickman 2 is yet another installment into this series where you can expect a ton of new levels with each having a simple goal. Try to get rid of all of the enemies in a given level. To do so, you will have to use as few bullets as you can, since their amount is limited. You won’t always be able to shoot your enemy up front, so try to use the bullet ricocheting from the walls. If you get through all of the levels, be sure to try the first installment!","instructions":"Mouse - Interaction","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9458\/IeL9neOxbqlsiH-400-300.jpg"}],"categoryList":[{"name":"Puzzle Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"Stickman Games"},{"name":"WebGL Games"}]}},{"game":{"title":"Stickman vs Stickman","url":"https:\/\/distribution.gameflare.com\/embed\/stickman-vs-stickman\/","description":"Stickman vs Stickman is an online puzzle game where you will have a singular objective - to eliminate all of the stickmen in a given level. Your hero will be shooting his weapon, but you only have a limited number of bullets, so be sure to think about how you're going to use them. In each of the levels, there are some obstacles that you need to use or avoid, to shoot your enemies. There’s a total of 60 levels waiting for you, so don’t worry about getting bored. Will you be able to get through all of them on your first try?","instructions":"Mouse - Interaction","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9445\/fBXF0QROPkRQIR-400-300.jpg"}],"categoryList":[{"name":"Puzzle Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"Stickman Games"},{"name":"WebGL Games"}]}},{"game":{"title":"Deer Simulator: Animal Family 3D","url":"https:\/\/distribution.gameflare.com\/embed\/deer-simulator-animal-family-3d\/","description":"Deer Simulator: Animal Family 3D is yet another great online game where you will be playing as a deer. There's a ton of adventures that you can start and find many different enemies and friends. You can build up your own house, start a family and buy accessories that will help you get through all of the obstacles the game throws at your feet. The game is offering a ton of options when it comes to character customization and improvement of your surroundings. If you start playing the game regularly, you will get a ton of great gifts, but you can start exploring the world without this in mind.\r\nIt's a great game with pleasant 3D graphics, so be sure to try it out, you won’t regret it.","instructions":"Arrow keys - Movement, Spacebar - Jump, Enter key - Attack, SHIFT - Sprint, E - Energy booster, R - Health booster, T - Hunger booster","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9441\/qFPCNQQSnx5OIu-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Survival games"}]}},{"game":{"title":"Hole Run 3D","url":"https:\/\/distribution.gameflare.com\/embed\/hole-run-3d\/","description":"Hole Run 3D is a simple online game with a singular goal. You have to suck up all of the objects ahead of you so that the ball doesn’t touch anything. The first levels will be simple, but as the number of obstacles grows larger and larger, the game will get more and more difficult. If it touches anything, the ball will fall apart and you’ll have to start the level again. Since the levels are generated automatically, their number is infinite. You can play the game for a long time before it starts to bore you.","instructions":"Mouse - Movement","width":400,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9439\/mqR6QW6XljJmCr-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"3D Games"},{"name":"Obstacle Games"},{"name":"Skill Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Bean Jump","url":"https:\/\/distribution.gameflare.com\/embed\/bean-jump\/","description":"Bean Jump is an interesting puzzle game where you will be controlling a little bean. Your objective will be to jump around platforms floating on water. There’s a problem however, since you can only jump on a platform once. After you jump away from it, it will disintegrate. There are many other rules that make the gameplay more engaging. The game is offering you a ton of levels, so expect hours and hours of fun. You can also buy new items that can help you break some platforms and thus make the game easier for you. Will you be able to finish all of the levels?","instructions":"Mouse - Interaction","width":400,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9428\/8cKJ4RrN5Zr20k-400-300.jpg"}],"categoryList":[{"name":"Puzzle Games"},{"name":"Jumping Games"},{"name":"Skill Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Defentures","url":"https:\/\/distribution.gameflare.com\/embed\/defentures\/","description":"The game is inspired by Kingdom rush and Age of War. In this game, you are building your kingdom and attacking the present enemy units. You need to find a way how to get as far as possible. Protect yourself and attack whenever the enemy least expects it. Find a way how to win, there’ll be a ton of options available for you, so be ready to have fun!","instructions":"Mouse - Interaction","width":900,"height":675,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9420\/ck5Ke88wR4bHAw-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"War Games"},{"name":"Base Defense Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Fantasy Games"}]}},{"game":{"title":"Water Boat Racing","url":"https:\/\/distribution.gameflare.com\/embed\/water-boat-racing\/","description":"Water Boat Racing is yet another racing game, this time, you will be racing on water, driving water scooters against other racers. Right at the beginning, you will be able to pick a country that you will be representing. You can pick from among many different levels where you will be trying to become the best player and reach the finish line first. Try to pick up boosters as you go, since they will help you reach a better position. The controls are mediocre, but you will surely get used to them after some time.","instructions":"Arrow keys - Movement","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9415\/aFG8y54SFs9VIU-400-300.jpg"}],"categoryList":[{"name":"Sports Games"},{"name":"3D Games"},{"name":"Racing Games"},{"name":"Jet Ski Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Car Mechanic 2020","url":"https:\/\/distribution.gameflare.com\/embed\/car-mechanic-2020\/","description":"Car Mechanic 2020 is another interesting simulator where you will try out a new job. You will become a car mechanic and you will try to fix all of the cars that your customers bring you. The game will guide you as to what to do with the cars, but it still won’t be that easy. Aside from that there is a time limit that you will need to be aware of. Sometimes it can be stressful, but you need to keep your calm, you will surely pass the game’s objectives. There will be many different levels for you to try out that you will unlock as you progress through the game. So put on a uniform and start playing!","instructions":"WASD keys - Movement, Mouse - Interaction","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9158\/s19ujwDjrTqf7j-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Skill Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Football Storm Strike","url":"https:\/\/distribution.gameflare.com\/embed\/football-storm-strike\/","description":"Football Storm Strike is an online sports game where you will be trying to score as many goals against your opponent as possible. You can pick in between four modes. You can either play the tournament mode or try to score as many points in a time limit. In the next mode you will be able to play with a friend and compare your skills. The last mode is the training mode where you will simply be trying to score, kicking the ball as you go. While kicking, you need to set the trajectory of the ball and give it a spin so that you can outsmart the goalie.","instructions":"Mouse - Interaction","width":400,"height":685,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9404\/5tTFqNdjxvpqpT-400-300.jpg"}],"categoryList":[{"name":"Sports Games"},{"name":"3D Games"},{"name":"Two players games"},{"name":"Soccer Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Infinity Royale","url":"https:\/\/distribution.gameflare.com\/embed\/infinity-royale\/","description":"Infinity Royale is an action online game where you will be playing as a soldier. Your objective will be to neutralize all of the enemies on the island. You will get transported there by a plane from which you will have to jump down. Firstly, you need to activate your parachute, else you crash into the ground and die. After that you can take a car and get closer to your enemies. You can neutralize them using the car, but the best course of action will be to use your weapon. For each of the levels, you get rewarded. You can later buy new guns in the store. Will you manage to get through all of the 10 missions on your first try?","instructions":"WASD keys - Movement, Mouse - Shooting, Spacebar - Jump \/ activate parachute, P - Pause, 1 || 2 - Change weapon, E - Interaction, F - Drop weapon, CTRL - Crouch, SHIFT - Sprint, Arrow keys - Drive car","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9397\/Akzn6myTe5GJam-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Soldier Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Iron Superhero","url":"https:\/\/distribution.gameflare.com\/embed\/iron-superhero\/","description":"Iron Superhero is an action online game where you will be playing as a superhero. Your main objective will be to save hostages and get rid of all of your enemies. Right at the start, you will move to a designated location where the game will provide you with a mission. After that, enemies will show up on the map and you will be tasked with destroying them. Your hero has a few skills of his own, he can shoot lasers, fly or jump really high. If you combine these skills, your enemies won't have a chance against you. The game offers you 20 levels in total, so it will take some time for you to finish the whole game. So come on, try the game out!","instructions":"Mouse - Shooting, WASD keys - Movement, Spacebar - Jump, SHIFT - Sprint, ALT || F - Fly mode, P - Pause, L - Mouse lock","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9396\/S8r3AThwCMaQiu-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Rescue Games"},{"name":"Flying Games"},{"name":"Shooting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Super Hero Games"}]}},{"game":{"title":"Five Nights at Old Toy Factory 2020","url":"https:\/\/distribution.gameflare.com\/embed\/five-nights-at-old-toy-factory-2020\/","description":"Five Nights at Old Toy Factory 2020 is a horror game where you will be working as a night guard in an old toy factory. One night, strange events will start taking place, since some of the toys will come to life and will try to kill you. Explore the factory and try to survive all 5 nights. Your only weapon is a glass bottle. Aside from that you can find notes in the individual rooms that will explain to you what has happened in this specific factory. Good luck.","instructions":"WASD keys - Movement, Left mouse button - Attack, Right mouse button - Block, F - Interaction, SHIFT - Run, CTRL - Crouch, Spacebar - Jump, P - Pause","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9392\/ctZUl6jrPvEQfj-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Robot Games"},{"name":"Escape Games"},{"name":"HTML5 games"},{"name":"Horror Games"},{"name":"WebGL Games"}]}},{"game":{"title":"C-Virus Game: Outbreak","url":"https:\/\/distribution.gameflare.com\/embed\/c-virus-game-outbreak\/","description":"C-Virus Game: Outbreak is an online horror game where 90% of the population were infected with a new virus and were transformed into bloodthirsty monsters. Also, you find yourself alone in an abandoned building and are trying to get out. The main doors are locked, so you need to find three keys that can be anywhere in the building. Since there's a lot of enemies around, you need to first find a weapon with some ammo so that you can defend yourself. After that, start looking for the keys. Will you be able to get through all of the levels on your first try?","instructions":"WASD keys - Movement, Mouse - Shooting, F - Interaction, SHIFT - Run, CTRL - Crouch, Spacebar - Jump, P - Pause, L - Mouse lock","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9390\/ftybCPRf0GIkHJ-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Escape Games"},{"name":"HTML5 games"},{"name":"Horror Games"},{"name":"WebGL Games"},{"name":"Virus Games"}]}},{"game":{"title":"FireStorm","url":"https:\/\/distribution.gameflare.com\/embed\/firestorm\/","description":"FireStorm is an action game from the future where the whole city is controlled by a single gang terrorizing the citizens living there. Your only option of saving the city is to eliminate the gang. You will have a few fighters at your disposal who will gladly help you out. Your objective will be to complete missions in each of the levels and thus earn money. The money can be used to buy upgrades for your fighter. During the fighting, you can also use vehicles, such as tanks that can help you eliminate your enemies much faster. If you want to pass a level, you must not die, so don't forget to pick up first-aid kids as you progress through the game. So come on, let’s play!","instructions":"WASD keys - Movement, Mouse - Shooting, Spacebar - Jump, SHIFT - Slow motion, Q || E - Change weapon, X - Throw grenades, Enter key - Enter vehicles, P - Pause","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9379\/7VbIlJxdkCjDUn-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Tank Games"},{"name":"Shooting Games"},{"name":"Future Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Backflip Maniac","url":"https:\/\/distribution.gameflare.com\/embed\/backflip-maniac\/","description":"Backflip Maniac is great online game, where you'll be jumping with your character. The first levels will be fairly easy, since you won’t be jumping from the highest buildings just yet. As you progress, the levels will get progressively higher. It’s very important to hit the red target, else you won’t be able to move to the next level. The controls can be a bit difficult for some, at the start, but you will adapt in the long run. Overall, the game offers you great gameplay, 3D graphics and 30 levels. So come on, let’s play!","instructions":"Mouse - Jump","width":400,"height":685,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9353\/le5syFXHJYiufR-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"Jumping Games"},{"name":"3D Games"},{"name":"Skill Games"},{"name":"Stunt Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Hunters and Props","url":"https:\/\/distribution.gameflare.com\/embed\/hunters-and-props\/","description":"Hunters and Props is a fun action online game where you’ll be fighting against other players on the server. You will be divided into two teams - hunters and requisites. As a hunter, you will be running around, trying to find those camouflaging as props. You have a little gadget at you that will determine whether there’s a prop hiding somewhere around you - it can either be red or green. While playing as prop, you must be very careful. Try to hide in a secret spot and hope that the enemy won’t be able to find you. Be sure to call up your friends so that you can play together or against each other. It’s going to be fun! We recommend you try the game out!","instructions":"WASD keys - Movement, Mouse - Shooting, SHIFT - Sprint, 1 || 4 - Change weapons, Enter key - Chat, E - Change props, Q - Audio taunt","width":960,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9330\/o5tTnJ2zV8t3mA-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Funny Games"},{"name":"3D Games"},{"name":"Multiplayer Games"},{"name":"Shooting Games"},{"name":"Hunting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"MineClicker","url":"https:\/\/distribution.gameflare.com\/embed\/mineclicker\/","description":"MineClicker is an online game where you’ll be killing different types of animals and mining blocks. For each animal, you earn points that can then be used to buy different upgrades or to hire up a new companion that will help you out. The blocks can be used to buy new weapons that will allow you to kill faster. The more companions and the better weapons you have, the faster you’ll progress in the game. Will you be able to slay the famous Enderdragon?","instructions":"Mouse - Interaction","width":900,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9329\/MQDQhzwahvgd3e-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"Upgrade Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Dino Hunting","url":"https:\/\/distribution.gameflare.com\/embed\/dino-hunting\/","description":"Dino Hunting is a game where your objective will be to hunt down all of the dinosaurs in your proximity. All you have to do is aim well and then shoot. Most of the dinosaurs won't be killed after the first show, so you need to shoot them multiple times. There's also another problem - the dinosaurs will try to catch your smell whenever you shoot. If they manage to do so, they will charge you. After that you will only have a few seconds to kill them. If you fail to do so, you die and will thus have to repeat the level. The game is divided into two locations with each offering a ton of levels that will keep you occupied.","instructions":"Left mouse button - Shooting, Right mouse button - Aim, R - Reload, L - Mouse lock, 1 || 2 - Change weapon","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9294\/ZlygVdEF7scCzP-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Hunting Games"},{"name":"Dinosaur Games"},{"name":"Sniper Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Turbo Race 3D","url":"https:\/\/distribution.gameflare.com\/embed\/turbo-race-3d\/","description":"Turbo Race 3D is a fun online game where you'll be able to enjoy quick races. You will be controlling a character riding a bike. You can drive slower or faster, whichever option you need at the moment. The goal is to collect as many coins as possible and to become the star of the race. To do so, you'll have to avoid all of the obstacles that you find on the way. You should also try to pick up any turbo that you see on the playing field. The controls are rather simple and all you need to do is move it from one side to the other. Good luck!","instructions":"Mouse - Movement","width":360,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9290\/SQ0D07tfD9slgu-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"3D Games"},{"name":"Racing Games"},{"name":"Collection Games"},{"name":"Stunt Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Crazy Car Stunts","url":"https:\/\/distribution.gameflare.com\/embed\/crazy-car-stunts\/","description":"Crazy Car Stunts is a crazy online game where you’ll be showing off your tricks in vehicles. There’s a lot of them available, so you can pick a sports car, a monster truck, a military vehicle, a bus or even a normal truck. Each of these have their own physics that can be changed during your play through. Aside from that you see the stats of your vehicle in detail. There are numerous ramps on the map, so pick the right car and you can start jumping around. Pick the right car and start jumping or simply driving around.","instructions":"Arrow keys - Driving, Spacebar - Break, V - Getting in \/ out of the car, C - Change camera, T - Attach trailer","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9273\/6gtb3AvlnyN6i9-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Racing Games"},{"name":"Truck Games"},{"name":"Stunt Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"City Tycoon","url":"https:\/\/distribution.gameflare.com\/embed\/city-tycoon\/","description":"City Tycoon is an online building game where you will be tasked with building up your city. Right at the beginning of the game, you will be able to set up the size of your map. Don’t be a megalomaniac though, it’s better to start small and expand with each play-through. Also, the game might start lagging if your city gets too large. The terrain can be adjusted to your needs. Terrain elevation can also be adjusted. Then, there are some buildings that you might build. You can also build on water. The most important thing is to have a flat terrain base. Don’t forget to build roads connecting the buildings so that cars can drive there. It’s an interesting online game, where you can build up the whole city according to your imagination, so come try it out!","instructions":"Left mouse button - Interaction, Scroll wheel - Move camera, Right mouse button - Rotate camera, WASD keys - Move on the map","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9232\/E5IA4FiLp6rSzy-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"3D Games"},{"name":"Building Games"},{"name":"Company Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Zombie Outbreak Arena","url":"https:\/\/distribution.gameflare.com\/embed\/zombie-outbreak-arena\/","description":"Zombie Outbreak Arena is an online action game where you will be fighting against hordes of undead. For each kill, you will be rewarded with XP that can then be used up to rank up. The game is offering you 5 different maps with a functioning day\/night cycle. That’s important because you get awarded with more XP points during the night. When it comes to weapons, these will be scattered randomly around you. Ammo will be limited, so you need to switch weapons frequently. You can also use your surroundings to eliminate your enemies. You can shoot a car tank so that it explodes and kills everyone around.","instructions":"Mouse - Shooting, WASD keys - Movement, R - Reload, Q || E - Change weapons, Spacebar - Dash, ESC - Menu","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9231\/pYlwwLkveRFzqt-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Shooting Games"},{"name":"Zombie Games"},{"name":"Upgrade Games"},{"name":"HTML5 games"}]}},{"game":{"title":"Steampunk Genius","url":"https:\/\/distribution.gameflare.com\/embed\/steampunk-genius\/","description":"Steampunk Genius is yet another great online game from PS Games. It’s the same game developer who brought you Genius Mechanic. Likewise, you will be able to build almost anything even in this game. Your only limit is your imagination. It’s all made in a steampunk theme. The game is offering you a ton of models that you can choose from, it can be an airplane, a car or even a robot spider walking around. All you need to do is find enough parts so that you wouldn’t have to remake everything. There are quality graphics available together with tons of fun.\r\n\r\nThe game can also be played on a <a href=\"https:\/\/play.google.com\/store\/apps\/details?id=com.psgames.sg\" target=\"_blank\">mobile phone<\/a>.","instructions":"Left mouse button - Interaction, Scroll wheel - Zoom, Right mouse button - Rotate camera, CTRL - Move camera","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9220\/HiEmjSyxfCBTg8-400-300.jpg"}],"categoryList":[{"name":"Puzzle Games"},{"name":"Car Games"},{"name":"3D Games"},{"name":"Flying Games"},{"name":"Building Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Police Helicopter","url":"https:\/\/distribution.gameflare.com\/embed\/police-helicopter\/","description":"Police Helicopter is a 3D online game where you will be flying a helicopter. Your objective is to find a vehicle that’s being driven by a criminal that you need to eliminate. This vehicle is being pursued by police vehicles though, so you need to watch out not to hit them. If you destroy them, you will have to start again. There are also skyscrapers in the city that you need to avoid, else you might crash into them. The game is offering you 20 levels in total that you will be continuously unlocking with new helicopters awaiting you. There’s a lot to look forward to!","instructions":"Arrow keys - Movement, W - Go up, S - Go down, A || D - Special rockets, Spacebar - Shooting","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9214\/YMxAtIohWyyDYJ-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Flying Games"},{"name":"Helicopter Games"},{"name":"Police Chase Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Mini Tennis 3D","url":"https:\/\/distribution.gameflare.com\/embed\/mini-tennis-3d\/","description":"Mini Tennis 3D is a great online game for tennis fans. If you don’t want to deal with any settings, you can simply start playing right away. Your objective will be to win every match. You will then start ascending the leader boards and earning more diamonds. These can be spent in the menu and you can buy a new character with these. There is 27 characters in total, so you will be able to choose whichever you want. You can also earn the diamonds in bonus levels where a mini-game awaits. During the fight, you can find many different bonuses that you can pick up. You can expect pretty graphics and simple gameplay, so enjoy the game!","instructions":"Mouse - Movement \/ interaction","width":800,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9168\/gvHcmawJlZJF26-400-300.jpg"}],"categoryList":[{"name":"Sports Games"},{"name":"3D Games"},{"name":"Tennis Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Sports Car Wash","url":"https:\/\/distribution.gameflare.com\/embed\/sports-car-wash\/","description":"Sports Car Wash is an interesting 3D game where you will be driving your customers’ cars into a car wash. Some will first need to be tanked, so that you don’t stop halfway to the car wash. You would have to repeat the level if that happened. You simply need to get to a gas station, stop the engine and fill your gas tank. After that you start the car up again and drive it to the car wash. When you get there, you again stop your engine, pay and then park the car next to the cleaning nozzles. When the car gets cleaned, you need to take it to a specified location. After doing that you can continue to the next level. In each of the levels there will be a different car waiting for you, it could be a sports car or a van. The objective will be the same, just take care not to run out of gas.","instructions":"Arrow keys - Driving, Spacebar - Handbrake, I - Engine on \/ off, C - Change camera","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9130\/AwOhcYsC3NYZbP-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Parking Games"},{"name":"Cleaning Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"The Island Survival","url":"https:\/\/distribution.gameflare.com\/embed\/the-island-survival\/","description":"The Island Survival is an action online game where you’ll be fighting for your life. You find yourselves alone in a small hut in the middle of nowhere. If you want to survive, you’ll have to find food and secure all of the resources you need to survive. You’re lucky, since there’s a ton of wild-life running around. It’s not always easy to hunt them down, but if you want to eat, you’ll have to try. You can also gather resources that you find on the ground. You can make tools out of them and build defenses and other structures. During the day, the surroundings are safe, but during night time, you better run hide in your hut, else feral animals might hunt you down. Enjoy this great game, where you’ll be playing on a deserted island!","instructions":"Mouse - Attack, WASD keys - Movement, E - Interaction, SHIFT - Run, I - Inventory, 1 || 9 - Change tool, P - Pause","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9125\/D6TUHjHDTg7AlU-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Building Games"},{"name":"Hunting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Survival games"}]}},{"game":{"title":"Offroad Cycle 3D","url":"https:\/\/distribution.gameflare.com\/embed\/offroad-cycle-3d\/","description":"Do you like adventures and natural beauty? If yes, then you’ll love Offroad Cycle 3D. You’ll sit on your mountain bike and will start driving through mountain passes. The goal will be to avoid all obstacles and to get to the finish line as fast as you can. Each level has its time limit, so don’t wait up too much. You also need to get some momentum when you’re driving up-hills, since you can very easily stop short of the top and then slide back down. The game has average 3D graphics and 10 levels where you’ll be tasked with showing your cycling skills. If you’re a fan of cycling, try the game out and see if you like it!","instructions":"Arrow keys - Driving, Spacebar - Brake, C - Change camera","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9105\/G8mjOmamD4aTOP-400-300.jpg"}],"categoryList":[{"name":"3D Games"},{"name":"Racing Games"},{"name":"Bike Games"},{"name":"Adventure Games"},{"name":"Skill Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Rickshaw Driving","url":"https:\/\/distribution.gameflare.com\/embed\/rickshaw-driving\/","description":"Rickshaw Driving is an interesting online game, where you’ll be driving a rickshaw. It’s a three wheeled cart that you move by cycling. Each driver has his max level of stamina, so you can’t always go as fast as you’d like. Your goal is to earn enough cash to buy a new vehicle or a new driver. This type of transport was very popular before cars made their appearance. At the moment, it’s still popular in Asia. Find out something about history and try the game out!","instructions":"Arrow keys - Driving, ESC - Back in the menu","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9097\/i2FpUlUopU6ZuV-400-300.jpg"}],"categoryList":[{"name":"3D Games"},{"name":"Bike Games"},{"name":"Taxi Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Water Slide 3D","url":"https:\/\/distribution.gameflare.com\/embed\/water-slide-3d\/","description":"Water Slide 3D is a great online game that you can play and slide down many great water slides. The goal of the game is to collect as many coins and special items that you can. Try to dodge all of the different obstacles that could endanger your life. You have a limited number of lives, so be really careful. Aside from that, you can also come across a surf that you can ride for a while. You can use the earned coins to unlock new characters or items, like glasses for instance. Will you be able to get through all of the levels on your first try? So jump on your bike and have fun!","instructions":"Arrow keys - Movement","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9096\/sL1ZD8d8nJTZ0D-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"3D Games"},{"name":"Roller Coaster Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Russian Truck Simulator","url":"https:\/\/distribution.gameflare.com\/embed\/russian-truck-simulator\/","description":"Russian Truck Simulator is a 3D online game where you’ll be controlling a truck. As is usual in these sorts of games, your objective will be to get the cargo safely towards the finish line. The terrain is pretty harsh to get through, so be prepared for a bumpy ride. Be sure not to fall from a cliff, since that would mean the end and you’d have to start from scratch. It’s better to slow down whenever you can, even though you have a time limit. For each level you complete, you are eligible for a reward that you can then spend by buying a new truck for instance. While driving, you can switch the camera angle, which will come in handy while parking, where you’ll need a view from the top. If you like big cars, you will surely enjoy this game.","instructions":"Arrow keys - Driving, I - Engine on \/ off, K || L - Lights, C - Change camera, Q || E - Blinker, Z - Warning lights","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9090\/o773sGOEwOwbvC-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Parking Games"},{"name":"Truck Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Underwater Cycling","url":"https:\/\/distribution.gameflare.com\/embed\/underwater-cycling\/","description":"Underwater Cycling is a game taking place underwater. It’s even weirder when you take in that you’ll be cycling underwater. Your objective will be to keep on the platform. If you fall down from it, you will have to repeat the level. On your way, you need to collect gems and other valuable items. At the same time, you’ll need to keep your eye on your oxygen level that will keep decreasing slowly. Don’t worry, you will find new oxygen sources as you cycle through the levels. Don’t waste time though, if your oxygen runs out, you’ll have to repeat the level. For your reward, you will be able to buy new riders, so don’t forget that.","instructions":"Arrow keys - Movement, SHIFT - Nitro","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9078\/YozEdUaeY7D9P0-400-300.jpg"}],"categoryList":[{"name":"3D Games"},{"name":"Racing Games"},{"name":"Bike Games"},{"name":"Sea Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Extreme Stunts Unlimited","url":"https:\/\/distribution.gameflare.com\/embed\/extreme-stunts-unlimited\/","description":"Extreme Stunts Unlimited is a very difficult game where you will be controlling a car on a dangerous platform. Your objective will be to get though all of the obstacles. Some of these will be static while others will be moving, like the giant guillotine that is present in the game. This will make the game a bit harder. You will need to show that you’re the best driver around. Each level has a time limit, so don’t waste time. You will have 10 levels at your disposal, so you won’t be bored. Can you get though all of the levels on your first try? Try it out!","instructions":"Arrow keys - Driving, Spacebar - Brake","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9071\/dFbHhE362wgLiz-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Racing Games"},{"name":"Skill Games"},{"name":"Stunt Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Twisty Rolling","url":"https:\/\/distribution.gameflare.com\/embed\/twisty-rolling\/","description":"Twisty Rolling is a quick game where you’ll be controlling a ball on a dangerous platform. You will have to react quickly, since the ball is heading towards obstacles that you will sometimes see at the last second. Aside from that you need to get further and earn points that you can then spend on skins. If you really want to get far try a trick. Get out of the platform, fly for a bit. You will then need to return back to the platform, else you’ll have to start again. Good luck!","instructions":"Arrow keys - Movement","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9069\/XgoWgzw0ttotL1-400-300.jpg"}],"categoryList":[{"name":"Jumping Games"},{"name":"3D Games"},{"name":"Platform Games"},{"name":"Running Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"SlidePark.io","url":"https:\/\/distribution.gameflare.com\/embed\/slideparkio\/","description":"SlidePark.io is a fun online game where you’ll be racing on a water slide. There are 20 enemies in front of your that you’ll need to get through so that you can finish first. You don’t need to worry the slide is long enough to accommodate that. You simply need to dodge everyone. If you crash into them, you will move them in front of you and you don’t want to do that. You can try a trick, when you get to the edge of the slide, you can jump down and shorten your way. But you need to aim precisely, since if you miss, the game ends for you. So good luck!","instructions":"Mouse - Movement","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9068\/dZHPGP3s2quqXe-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"Jumping Games"},{"name":"3D Games"},{"name":"Roller Coaster Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"IO Games"}]}},{"game":{"title":"Touchdown!","url":"https:\/\/distribution.gameflare.com\/embed\/touchdown\/","description":"Touchdown! is a funny online game where you’ll be playing American football. Your objective is to get as many points as you can and thus defeat your opponent. You can only do that by scoring a touchdown. You need to get the ball to the end of the playing field. Move around the playing field in such a way that you get the ball from your opponent or protect the ball in your possession. If you have a friend nearby, you can both play on one PC. It’s much more fun and you can see who the better player is. The game offers simple gameplay and pixelated 2D graphics that you’ll surely love. Come try the game out!","instructions":"Arrow keys - Movement, WASD keys - Movement","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9062\/rdmhn0REbu647m-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"Sports Games"},{"name":"Two players games"},{"name":"American Football Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Lion Hunter","url":"https:\/\/distribution.gameflare.com\/embed\/lion-hunter\/","description":"Lion Hunter is an action 3D game where you’ll be playing as a lion hunter. There are a few levels awaiting you where you’ll have a single goal on your mind, to kill dangerous animals and thus protect the jungle. Some lions only take one bullet to kill, other will need at least two. After the first shot, the lions will run towards you, so be ready. There are numerous levels where you won’t be in immediate danger, but you’ll still have to protect other animals like zebras. You need to fire as quickly as you can. Each level also has a time limit, so take care.","instructions":"Mouse - Shooting","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9061\/i6JAEV6Lu1ndkV-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Hunting Games"},{"name":"Animal Games"},{"name":"Sniper Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Wild Wolves","url":"https:\/\/distribution.gameflare.com\/embed\/wild-wolves\/","description":"Wild Wolves is a 3D game, where you’ll be controlling a wild wolf. You will be trying to complete each level, with each level being a bit different. At the beginning, the game will be rather simple – follow the alpha. After that, you will need to hunt for prey or defend the pack from enemies. Read the instructions outlining the objective so that you always know what to do. There’s a time limit present for each level, so if you fail to finish it in that timeframe, you will have to repeat it. The game has average 3D graphics and the controls could be better, but it’s still a shame that the game only offers you 9 levels. Will you manage to complete all 9 of them at your first try?","instructions":"Arrow keys - Movement, SHIFT - Sprint, Spacebar - Attack","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9057\/AX2aDSJbdSYz7n-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Hunting Games"},{"name":"Wolf Games"},{"name":"Fighting Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Boat Rescue","url":"https:\/\/distribution.gameflare.com\/embed\/boat-rescue\/","description":"Boat Rescue is a 3D game, where you’ll be trying to saving people stranded on and in buildings after a flood hit the city. Ride your boat and embark on that dangerous mission. Controlling the boat among all of the floating debris won’t be an easy task and you also need to get as close to a person as possible, so that he manages to float to your location. When you pick him up, try to get to a bigger boat as fast as possible, so professionals can take care of the survivors you bring them. You’ll have to work within a time limit, so be careful not to get stranded. It could very well happen that you’ll have to repeat the level if that happens. So come try the game out!","instructions":"Arrow keys - Driving","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9056\/iggNGrwD4yaZCY-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Boat Games"},{"name":"Rescue Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Bird Flight","url":"https:\/\/distribution.gameflare.com\/embed\/bird-flight\/","description":"Bird Flight is a 3D online game, where you’ll be flying with a bird over beautiful landscapes. Your only objective will be to fly through the rings and to get as far as possible. At the beginning, this might seem very simple, but it will get progressively harder and harder with each level, since your reaction time will have to get slower and slower. Also dodge trees and other obstacles that can take one life away. Try to get the best score you can and overcome your previous high score. You can pick new skins in the menu, so come on, let’s try the game out!","instructions":"Mouse - Movement","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9055\/xelB7Lezym4L5U-400-300.jpg"}],"categoryList":[{"name":"3D Games"},{"name":"Observation Games"},{"name":"Flying Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"Bird Games"},{"name":"WebGL Games"}]}},{"game":{"title":"Russian Train Simulator","url":"https:\/\/distribution.gameflare.com\/embed\/russian-train-simulator\/","description":"Russian Train Simulator is yet another game from a long line of simulators that will let you be the train engineer. The game offers you three modes – training mode, people transport mode and cargo transport mode. Your objective is to reach the the station, wait for the people to get on, or the cargo to get loaded and then move them to the terminus station. Take care to stop before the red notification. If you stop after that, or you fail to finish before the time runs out, the game ends and you’ll have to repeat the whole level. Aside from that you can also change camera angles and have the camera from inside of the locomotive. That’s pretty realistic. Have fun!","instructions":"Mouse - Interaction","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9048\/9dRRC0eWrYSUuZ-400-300.jpg"}],"categoryList":[{"name":"3D Games"},{"name":"Traffic Games"},{"name":"Train Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Xtreme Monster Truck","url":"https:\/\/distribution.gameflare.com\/embed\/xtreme-monster-truck\/","description":"In today’s online game Xtreme Monster Truck, you will be able to drive a few great vehicles. As is common in these games, you will have to get through a few demanding obstacles, so that you can reach the next level. On your way, you will have to get as many coins as possible that you can later use to unlock new vehicles. You have two worlds that you can choose from, together with 10 levels whose difficulty will be rising slowly, which means that you’ll be getting less and less time to complete everything. The speed isn’t everything since you’ll have to control your truck. So drive carefully. The game is offering you great 3D graphics, so be sure to try it out!","instructions":"Arrow keys - Driving, Spacebar - Handbrake","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9041\/JNHRuBTqTIqoAz-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Racing Games"},{"name":"Skill Games"},{"name":"Stunt Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Crazy Bull Attack","url":"https:\/\/distribution.gameflare.com\/embed\/crazy-bull-attack\/","description":"In today’s game, you will be working as a hunter. The city has called you after several bulls escaped into the streets and are smashing whatever they can find. Your objective is to start removing them and thus save the people living there. At the beginning there won’t be that many of them, but soon it will get harder for you to survive. Use the cash you earn to buy new weapons that will help you in your fight against these dangerous animals. The game is offering OK graphics and simple controls, so come on, try it out!","instructions":"Mouse - Shooting, WASD keys - Movement, Spacebar - Jump, SHIFT - Sprint, P - Pause, L - Mouse lock","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9038\/Q8O0REdt25fqmL-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Hunting Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Cash Transport Simulator","url":"https:\/\/distribution.gameflare.com\/embed\/cash-transport-simulator\/","description":"In today’s 3D game, you will be working as an employee of a bank. Your objective will be to drive money to ATMs at precise locations. You’ll be doing the same thing over and over – pick up the money at a bank. Get into the car. Start driving towards an ATM and put in the money. After that you need to drive your car to work and it’s over. Your colleague is always with you and will help you if you get attacked. While driving, try to be as careful as possible. All it takes is to crash into an innocent civilian and the game can end right afterwards. So come on and play!","instructions":"Arrow keys - Movement, Spacebar - Handbrake, E - Enter the car, P - Pause, L - Mouse lock","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9037\/yMnznMoMBgrZXi-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Racing Games"},{"name":"Parking Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Dino Transport","url":"https:\/\/distribution.gameflare.com\/embed\/dino-transport\/","description":"Dino Transport is an interesting online game where you’ll be playing as a truck driver. Your main objective will be to get your dinosaurs to a local Zoo which won’t be easy at all. You will have to get through marked areas and park at the right spot. There’s a time limit present, so you won’t have unlimited time to do that. The game offers you three modes. You can just simply drive around, or move your dinosaurs. Then there’s the third mode, where it can get really dangerous. One dinosaur escaped from his cage and you’ll have to catch it. So catch him and get him to the finish line, else you’re finished. So come on, let’s play.","instructions":"Arrow keys - Driving, Spacebar - Handbrake, C - Change camera, ESC - Pause","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9035\/KmOxkUVCbx8pYr-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Parking Games"},{"name":"Truck Games"},{"name":"Dinosaur Games"},{"name":"Zoo Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Xtreme Demolition Arena Derby","url":"https:\/\/distribution.gameflare.com\/embed\/xtreme-demolition-arena-derby\/","description":"Xtreme Demolition Arena Derby is yet another great game where you’ll be destroying enemy cars in an arena. In each level, there will be a kill count that you’ll have to fulfill, so that you win and move further up. Of course, you will be rewarded with money that you can later use to unlock new vehicles. There’s a total of 6 of them available. During the game, try not to crash into barrels, since they can explode and destroy your vehicle. Try to play tactically at first and push your enemies into them. If the game lags at first, you can use the settings to lower your quality.","instructions":"Arrow keys - Driving, Spacebar - Handbrake, C - Change camera","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9029\/3d8ofrNxVSTsPk-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Racing Games"},{"name":"Destroy Games"},{"name":"Arena Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Hungry Shark","url":"https:\/\/distribution.gameflare.com\/embed\/hungry-shark\/","description":"Hungry Shark is a pretty rough game where you’ll be controlling a big shark. As the name suggests your objective will be to hunt down as many beach goers as you can. At the top of your screen is a kill count that you need to reach. You can eat both the people swimming and the people on boats. When they fall into the water you can attack them. Aside from that you can get a speed boosts for a while. You also need to take care to look at your time, since a longer period of not killing anyone could mean game over. Will you be able to get through all of the levels on your first try?","instructions":"Arrow keys - Movement, W - Acceleration, P - Pause","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9023\/H1q2uDp2KRSpxR-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Bloody Games"},{"name":"3D Games"},{"name":"Shark Games"},{"name":"Hunting Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Crazy Demolition Derby V1","url":"https:\/\/distribution.gameflare.com\/embed\/crazy-demolition-derby-v1\/","description":"Crazy Demolition Derby V1 is a great game where you can try destroying many different vehicles. Of course, you are trying to destroy your opponents’ cars, not your own. These demolitions and wins will bring you more money that you can later use for buying upgrades and changing the style and power of your vehicle. You can also buy an entirely new car. Since this is a multiplayer game, you will be playing with real players, or even your friends if you invite them. The game offers you 3D graphics and fun gameplay, so don’t worry about getting bored. There can be up to 14 people in one lobby. Aside from that the game offers you 6 maps.","instructions":"Arrow keys - Driving, Spacebar - Handbrake, B - Look back, C - Change camera, TAB - Statistics","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9014\/hT3padiLsAuZJ5-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Multiplayer Games"},{"name":"Racing Games"},{"name":"Destroy Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Hit Targets","url":"https:\/\/distribution.gameflare.com\/embed\/hit-targets\/","description":"Hit Targets is an online game where you’ll be using a sniper rifle. Your objective will be to hit all of the targets in a specific level. At the beginning this will be easy, since the objects will be very close to each other. Each level will rack up the difficulty a bit and with each level, the targets will be getting a bit smaller. The greater the distance between you and the target, the more you’ll scope will be moving. You also need to count with wind speed and direction. So in total, there’s 15 levels awaiting you. So come on, let’s play!","instructions":"Left mouse button - Shooting, Right mouse button - Aim, 1 || 4 - Zoom, H - Hold breath, P - Pause","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9013\/iPnk8IhP1EoHcc-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Sniper Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Maze Cube","url":"https:\/\/distribution.gameflare.com\/embed\/maze-cube\/","description":"Maze Cube is a reflex focused game where you’ll be trying to get your ball into the maze and then out again. The problem is that you can only move forwards and there’s no way of stopping. Aside from that you cannot touch any of the walls of the maze, else the game ends and you’ll have to start again. The game has a single goal for you, to stay alive and to earn as many points as you can. Aside from that you can also try to pick up diamonds on your way. The graphics is really minimalistic, so don’t expect anything stellar. So come on, let’s play!","instructions":"Arrow keys - Movement","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9008\/7R7wK3rTkzmKsL-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"3D Games"},{"name":"Observation Games"},{"name":"Maze Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Bus Parking Simulator","url":"https:\/\/distribution.gameflare.com\/embed\/bus-parking-simulator\/","description":"Bus Parking Simulator is a great game where you’ll be playing as a bus driver. Your objective will of course be to get through all of the obstacles and to get the bus to the highlighted place. Try to park as precisely as you can, else the game won’t count your try and you’ll have to repeat the level. There will be a total of 40 levels in 3D graphics awaiting you. If you have trouble controlling such a behemoth of a vehicle, you can switch to a roof camera view that will help you a bit. You can use the money you’ve earned in the store to buy a new bus. So come on, light up the engine and start driving!","instructions":"Arrow keys - Driving, Spacebar - Handbreak, C - Change camera","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/9006\/Vj403imCKISuzs-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Parking Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Russian Hill Driver","url":"https:\/\/distribution.gameflare.com\/embed\/russian-hill-driver\/","description":"In today’s game, you will be playing as a Russian truck driver. Your objective will be to transport heavy cargo to a specified location. You first need to pick up the cargo and then follow the road signs that will lead you to your destination. There will be numerous obstacles waiting for you that you need to overcome, because if your cargo falls out of the truck, you’ll have to restart the level. When you get into your garage, you’ll be able to change your car’s color, or to buy entirely new car. It’s up to you. Later, you’ll be able to unlock the winter settings that are locked at the beginning of the game. So start up your car and let’s play!","instructions":"Arrow keys - Driving, Spacebar - Brake, C - Change camera","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8998\/dDpmvmzy2pSH40-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Parking Games"},{"name":"Truck Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Billiard Tour","url":"https:\/\/distribution.gameflare.com\/embed\/billiard-tour\/","description":"Billiard Tour is a great online game for all fans of billiard. In this game, you will be trying to become a professional player. To do so, you’ll have to get through a multitude of levels. There will always be a different number of balls and they will be put on the table differently. Your objective will be to get rid of all the balls. The problem is however, that you have a limited number of lives, which means that you can miss only a few times. Try to thus be as precise as you can, so that you hit everything on your first try, since you will lose lives if you don’t and you don’t want to repeat the level because of it. The money you earn can be used in the store to buy new equipment.","instructions":"Mouse - Interaction","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8997\/TvZkVxM78cTfMy-400-300.jpg"}],"categoryList":[{"name":"Sports Games"},{"name":"Pool Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Football World Cup 2019","url":"https:\/\/distribution.gameflare.com\/embed\/football-world-cup-2019\/","description":"Today, we have a great 3D football game to offer to every sports fan. At the beginning of the game, you will pick your favorite team. There won’t be any classic clubs, but rather national teams. You can also pick the length of a match and the difficulty of the AI. You can then start up the match, where you’ll be trying to score as many goals as possible. If you pick the Hard AI difficulty, don’t forget to pass the ball as much as you can and to aim before shooting. If you don’t do that, your opponent will get the ball and it will be really difficult to take it from him. So come try the game out!","instructions":"Arrow keys - Movement, Z || Y - Pass \/ slide tackle, X - Shooting","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8973\/pWXlJv2QCT8Ugn-400-300.jpg"}],"categoryList":[{"name":"Sports Games"},{"name":"3D Games"},{"name":"Soccer Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Incredible Monster","url":"https:\/\/distribution.gameflare.com\/embed\/incredible-monster\/","description":"In this game, you will be controlling a big, mutated monster that is trying to save the city. You will of course be helping it with its task. At the beginning of the game, you choose your color. At start, only green is available, but you can buy other colors for coins later in the game. There is a total of 4 different bigger missions. In each missions there are a few levels awaiting you, where you’ll be trying to kill all of your enemies. These enemies are marked with a red dot on the map. All you need to do is find them, fight them and win. At the beginning, these opponents won’t give you much of a fight, but later, their numbers will be growing and they’ll get stronger and stronger. Don’t forget your special attack and the fact that you can even throw a car at them. There’s also a time limit, so don’t slow down too much. Can you save the whole city?","instructions":"Mouse - Attack, WASD keys - Movement, Spacebar - Jump, Q - Kick, E - Special attack, C - Vehicle lift \/ drop, M - Map, P - Pause","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8967\/Galu85i3eFfhpc-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Fighting Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Super Hero Games"}]}},{"game":{"title":"Penguins.io","url":"https:\/\/distribution.gameflare.com\/embed\/penguinsio\/","description":"Penguins.io is an addictive game where you control a small penguin fighting on an ice-berg. Your objective will be to push all of the other penguins off. If you become the last surviving penguin, you win. It’s sort of an icy battle royale. The one who survives last, wins. The iceberg will be getting smaller and smaller as individual pieces will begin to fall off. That’s why it’ll become increasingly difficult to defend against enemy attacks and to survive. You have no other chance than to attack first. All you need to do is point your penguin in the right direction and load up as much strength as you can. This way you can launch off more opponents at once.","instructions":"Mouse - Movement","width":450,"height":735,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8962\/4KFP33SuwJJ6I4-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Funny Games"},{"name":"3D Games"},{"name":"Penguin Games"},{"name":"Animal Games"},{"name":"Winter Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"IO Games"},{"name":"Battle Royale Games"}]}},{"game":{"title":"Ninja Cube","url":"https:\/\/distribution.gameflare.com\/embed\/ninja-cube\/","description":"Ninja Cube is an online game in pixelated graphics where you’ll be controlling a ninja warrior. You just need to aim a bit and shoot him right up into the air. His advantage is that he can switch directions mid-air and attack an otherwise well-hidden enemy. Try to collect all shurrikens so that you get awarded all of the available stars. The main goal of this game is to find the princess who has been taken prisoner. So come on, start playing!","instructions":"Mouse - Interaction","width":800,"height":535,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8959\/8XtA7i9v77Tv2C-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Ninja Games"},{"name":"Rescue Games"},{"name":"Fighting Games"},{"name":"Collection Games"},{"name":"HTML5 games"}]}},{"game":{"title":"Ambulance Driver","url":"https:\/\/distribution.gameflare.com\/embed\/ambulance-driver\/","description":"Ambulance Driver is a 3D game, where you’ll be controlling an ambulance. Your objective will be to get the paramedics to the precise location of the accident. After picking up the patients, you will be driving them to the hospital based on the locations given to you. The city is huge, so you could get lost without your trusty map. To add to the stress, there’s a time limit to each level. If you fail, you’ll have to repeat the level. You also must not crash during your driving session. The is offering you 10 levels and lower end graphics. So sit in your ambulance and save lives!","instructions":"Arrow keys - Driving, Spacebar - Brake","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8952\/UWc09hUX3s1S2a-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Racing Games"},{"name":"Parking Games"},{"name":"Flying Games"},{"name":"Helicopter Games"},{"name":"Hospital Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Apocalypse World","url":"https:\/\/distribution.gameflare.com\/embed\/apocalypse-world\/","description":"Zombie apocalypse is upon us and most of humanity is already dead. Most of those who aren’t dead have turned into bloodthirsty zombies. Few survivors, however, are immune to the disease. These people don’t have it easy, since they need to fight for their lives all day long. Your hero is one of those people and you’ll need to help him survive in this inhospitable land. To survive, try to look for empty buildings and water sources. Avoid zombies that can attack you at any moment. Try to move slowly in a car or a motorbike, since you can cover more ground this way and it won’t be as dangerous as going on foot. \n \n The game includes: \n * Driving bikes, cars and riding horses\n * Flying on a glider\n * Fighting the zombies\n * A big, open world.","instructions":"Mouse - Shooting, WASD keys - Movement, SHIFT - Sprint, E - Interaction, F - Get off the horse, CTRL - Crouch, 1 || 2 - Change weapon, P - Pause, L - Mouse lock","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8944\/vfCZzedjzIJhWP-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Car Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Zombie Games"},{"name":"Horse Games"},{"name":"Animal Games"},{"name":"HTML5 games"},{"name":"WebGL Games"},{"name":"Survival games"}]}},{"game":{"title":"Forest Hunter","url":"https:\/\/distribution.gameflare.com\/embed\/forest-hunter\/","description":"In today’s game, you’ll be playing as a hunter who will be trying to catch a certain number of game. Right at the beginning you can choose what type of animal you want to hunt for. There are six options to choose and the harder to catch types include rabbits and ducks. You need to be careful around wolves, who will attack you right after you fire your gun. There are difficulty levels to choose that come with each animal, but if you start lowering them, the reward will be smaller. Try to earn as much money as you can to buy new guns at the store. There’s a lot of them available, some look great, even though they may be more expensive than others. The hunting season started already, so let’s go!","instructions":"Mouse - Shooting, E - Night vision, P - Pause","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8926\/1A9QtbHti8Ooct-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Hunting Games"},{"name":"Animal Games"},{"name":"Sniper Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Farmer Simulator 2019","url":"https:\/\/distribution.gameflare.com\/embed\/farmer-simulator\/","description":"Today, we’re presenting you a great simulator game where you’ll try out what’s it like to be farmer. The game offers you 20 different levels where you’ll be cultivating and caring for your crops. Aside from that, you will also be able to drive some farm machinery that can make your life easier. For each level, you will get rewarded, so that you can buy new tractors and equipment. Take care not to run out of fuel while working, since you would have to buy it and start again. If you love simulators, this game will be great for you!","instructions":"Arrow keys - Driving, X - Activate machine","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8905\/H21pY6UP5OeyPX-400-300.jpg"}],"categoryList":[{"name":"Car Games"},{"name":"3D Games"},{"name":"Truck Games"},{"name":"Farm Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Crazy Machines","url":"https:\/\/distribution.gameflare.com\/embed\/crazy-machines\/","description":"Crazy Machines is an action online game where you’ll be controlling a flying fighting machine. Your objective will be to destroy other machines that are trying to attack you. The game is divided into more levels, with each of them having stronger and stronger enemies. You can finish a few rounds with the original machine that you’re given, but you’ll soon find out that you need to upgrade it a bit if you want to have a chance against the stronger enemies that you’ll encounter. Become the best player on your block!","instructions":"Mouse - Interaction","width":960,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8881\/zxmCqSjKWzqb87-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Destroy Games"},{"name":"Upgrade Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Airplane Tunnel","url":"https:\/\/distribution.gameflare.com\/embed\/airplane-tunnel\/","description":"In this game, you will be controlling an airplane in a dangerous tunnel. It’s dangerous mainly because of all the obstacles that are blocking your way. The blue ones can be destroyed via your rockets, but beware, since you only have a limited amount of these. The red obstacles cannot be destroyed at all, so you always have to dodge them. Aside from that you need to collect golden coins that can later be used to buy a new airplane that has more rockets available. You may also get extra rockets from time to time, but don’t count on it.","instructions":"Arrow keys - Movement, Spacebar - Shooting","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8871\/hgt9YZWuYq8Y2K-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Observation Games"},{"name":"Flying Games"},{"name":"Shooting Games"},{"name":"Skill Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Cat Runner","url":"https:\/\/distribution.gameflare.com\/embed\/cat-runner\/","description":"Today, we’re presenting you a great 3D game, where you’ll be running around city streets with a cat. Your objective will be to pick up bones and to dodge individual obstacles. Aside from static obstacles, you’ll also have to avoid gigantic rats or mad dogs. If you touch any of your enemies, the game will take one heart away from you. You have a total of three lives, so take care. You can also try to complete many different missions that will reward you with a price once you succeed!","instructions":"Arrow keys - Movement","width":375,"height":660,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8829\/ERPrf09OKllMfo-400-300.jpg"}],"categoryList":[{"name":"Funny Games"},{"name":"Jumping Games"},{"name":"3D Games"},{"name":"Running Games"},{"name":"Animal Games"},{"name":"Cat Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Hunter 3D","url":"https:\/\/distribution.gameflare.com\/embed\/hunter-3d\/","description":"Today, we present you an interesting 3D game where you’ll be playing as a hunter. The game is divided in 2 parts and in each of them, you will be competing with an opponent. You will be tasked with shooting more targets than your competitors. The closer to the middle you hit, the more points you’ll get. Your objective is to win, so be sure to be as accurate as possible.","instructions":"Mouse - Shooting","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8601\/3UHwYIrDAaP8mE-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Hunting Games"},{"name":"Animal Games"},{"name":"Sniper Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Strong Defense","url":"https:\/\/distribution.gameflare.com\/embed\/strong-defense\/","description":"In today's online game, you'll be playing as an archer tasked with a very important objective. You'll be guarding the castle gates against a never-ending horde of enemies. The enemy lines include monsters like trolls that will move slowly or flying creatures that will be more difficult to hit. So try concentrate as much as you can and don't forget to buy upgrades, since they can make the odds of winning better!","instructions":"Mouse - Shooting","width":1000,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/8096\/LK6dEHKafLUhpB-400-300.jpg"}],"categoryList":[{"name":"Strategy Games"},{"name":"War Games"},{"name":"Archery Games"},{"name":"Magic Games"},{"name":"Upgrade Games"},{"name":"Base Defense Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Battle Tanks","url":"https:\/\/distribution.gameflare.com\/embed\/battle-tanks\/","description":"Today we present you a modern online version of the legendary Battle City. Your goal will again be to protect your home base from enemy tanks. First levels will be fairly easy, but it’s gonna get hard real fast. It will get progressively harder, since the enemies will be protected by shields later on. Try to shoot the enemy car, since you can get some nice bonuses this way. 20 different levels are awaiting you.","instructions":"Arrow keys - Movement, Spacebar - Shooting","width":960,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/7555\/3vPMBFrDPJ2Ns2-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"Tank Games"},{"name":"Shooting Games"},{"name":"Base Defense Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}},{"game":{"title":"Insects: Alien Shooter","url":"https:\/\/distribution.gameflare.com\/embed\/insects-alien-shooter\/","description":"Your team left you all alone and now you have to take care of everything… alone. The planet is crawling with enemies. You are hearing strange sounds. They are getting closer now. You must stay calm, pick up your weapon and shoot everything that moves. You’ll need luck to survive, but believe me when I say it’s going to be a fun ride.","instructions":"Mouse - Shooting, P - Menu","width":960,"height":635,"assetList":[{"name":"https:\/\/data.gameflare.com\/games\/7462\/dYrFcbsKTq7jYP-400-300.jpg"}],"categoryList":[{"name":"Action Games"},{"name":"3D Games"},{"name":"Shooting Games"},{"name":"Alien Games"},{"name":"HTML5 games"},{"name":"WebGL Games"}]}}]}